GopalSaraf/Practicals/PSDL/include/proc/pic18f06q41.h
extern volatile MD1SRCPPSbits_t MD1SRCPPSbits __at(0x260);
// bitfield macros
#define _MD1SRCPPS_PIN_POSN                                 0x0
#define _MD1SRCPPS_PIN_POSITION                             0x0
#define _MD1SRCPPS_PIN_SIZE                                 0x3
#define _MD1SRCPPS_PIN_LENGTH                               0x3
#define _MD1SRCPPS_PIN_MASK                                 0x7
#define _MD1SRCPPS_PORT_POSN                                0x3
#define _MD1SRCPPS_PORT_POSITION                            0x3
#define _MD1SRCPPS_PORT_SIZE                                0x3
#define _MD1SRCPPS_PORT_LENGTH                              0x3
#define _MD1SRCPPS_PORT_MASK                                0x38
#define _MD1SRCPPS_MDSRCPPS0_POSN                           0x0
#define _MD1SRCPPS_MDSRCPPS0_POSITION                       0x0
#define _MD1SRCPPS_MDSRCPPS0_SIZE                           0x1
#define _MD1SRCPPS_MDSRCPPS0_LENGTH                         0x1
#define _MD1SRCPPS_MDSRCPPS0_MASK                           0x1
#define _MD1SRCPPS_MDSRCPPS1_POSN                           0x1
#define _MD1SRCPPS_MDSRCPPS1_POSITION                       0x1
#define _MD1SRCPPS_MDSRCPPS1_SIZE                           0x1
#define _MD1SRCPPS_MDSRCPPS1_LENGTH                         0x1
#define _MD1SRCPPS_MDSRCPPS1_MASK                           0x2
#define _MD1SRCPPS_MDSRCPPS2_POSN                           0x2
#define _MD1SRCPPS_MDSRCPPS2_POSITION                       0x2
#define _MD1SRCPPS_MDSRCPPS2_SIZE                           0x1
#define _MD1SRCPPS_MDSRCPPS2_LENGTH                         0x1
#define _MD1SRCPPS_MDSRCPPS2_MASK                           0x4
#define _MD1SRCPPS_MDSRCPPS3_POSN                           0x3
#define _MD1SRCPPS_MDSRCPPS3_POSITION                       0x3
#define _MD1SRCPPS_MDSRCPPS3_SIZE                           0x1
#define _MD1SRCPPS_MDSRCPPS3_LENGTH                         0x1
#define _MD1SRCPPS_MDSRCPPS3_MASK                           0x8
#define _MD1SRCPPS_MDSRCPPS4_POSN                           0x4
#define _MD1SRCPPS_MDSRCPPS4_POSITION                       0x4
#define _MD1SRCPPS_MDSRCPPS4_SIZE                           0x1
#define _MD1SRCPPS_MDSRCPPS4_LENGTH                         0x1
#define _MD1SRCPPS_MDSRCPPS4_MASK                           0x10
#define _MD1SRCPPS_MDSRCPPS5_POSN                           0x5
#define _MD1SRCPPS_MDSRCPPS5_POSITION                       0x5
#define _MD1SRCPPS_MDSRCPPS5_SIZE                           0x1
#define _MD1SRCPPS_MDSRCPPS5_LENGTH                         0x1
#define _MD1SRCPPS_MDSRCPPS5_MASK                           0x20
#define _MD1SRCPPS_MDSRCPPS_POSN                            0x0
#define _MD1SRCPPS_MDSRCPPS_POSITION                        0x0
#define _MD1SRCPPS_MDSRCPPS_SIZE                            0x6
#define _MD1SRCPPS_MDSRCPPS_LENGTH                          0x6
#define _MD1SRCPPS_MDSRCPPS_MASK                            0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned MDSRCPPS0              :1;
        unsigned MDSRCPPS1              :1;
        unsigned MDSRCPPS2              :1;
        unsigned MDSRCPPS3              :1;
        unsigned MDSRCPPS4              :1;
        unsigned MDSRCPPS5              :1;
    };
    struct {
        unsigned MDSRCPPS               :6;
    };
} MDSRCPPSbits_t;
extern volatile MDSRCPPSbits_t MDSRCPPSbits __at(0x260);
// bitfield macros
#define _MDSRCPPS_PIN_POSN                                  0x0
#define _MDSRCPPS_PIN_POSITION                              0x0
#define _MDSRCPPS_PIN_SIZE                                  0x3
#define _MDSRCPPS_PIN_LENGTH                                0x3
#define _MDSRCPPS_PIN_MASK                                  0x7
#define _MDSRCPPS_PORT_POSN                                 0x3
#define _MDSRCPPS_PORT_POSITION                             0x3
#define _MDSRCPPS_PORT_SIZE                                 0x3
#define _MDSRCPPS_PORT_LENGTH                               0x3
#define _MDSRCPPS_PORT_MASK                                 0x38
#define _MDSRCPPS_MDSRCPPS0_POSN                            0x0
#define _MDSRCPPS_MDSRCPPS0_POSITION                        0x0
#define _MDSRCPPS_MDSRCPPS0_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS0_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS0_MASK                            0x1
#define _MDSRCPPS_MDSRCPPS1_POSN                            0x1
#define _MDSRCPPS_MDSRCPPS1_POSITION                        0x1
#define _MDSRCPPS_MDSRCPPS1_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS1_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS1_MASK                            0x2
#define _MDSRCPPS_MDSRCPPS2_POSN                            0x2
#define _MDSRCPPS_MDSRCPPS2_POSITION                        0x2
#define _MDSRCPPS_MDSRCPPS2_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS2_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS2_MASK                            0x4
#define _MDSRCPPS_MDSRCPPS3_POSN                            0x3
#define _MDSRCPPS_MDSRCPPS3_POSITION                        0x3
#define _MDSRCPPS_MDSRCPPS3_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS3_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS3_MASK                            0x8
#define _MDSRCPPS_MDSRCPPS4_POSN                            0x4
#define _MDSRCPPS_MDSRCPPS4_POSITION                        0x4
#define _MDSRCPPS_MDSRCPPS4_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS4_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS4_MASK                            0x10
#define _MDSRCPPS_MDSRCPPS5_POSN                            0x5
#define _MDSRCPPS_MDSRCPPS5_POSITION                        0x5
#define _MDSRCPPS_MDSRCPPS5_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS5_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS5_MASK                            0x20
#define _MDSRCPPS_MDSRCPPS_POSN                             0x0
#define _MDSRCPPS_MDSRCPPS_POSITION                         0x0
#define _MDSRCPPS_MDSRCPPS_SIZE                             0x6
#define _MDSRCPPS_MDSRCPPS_LENGTH                           0x6
#define _MDSRCPPS_MDSRCPPS_MASK                             0x3F

