GopalSaraf/Practicals/PSDL/include/proc/pic18f06q41.h
extern volatile I2C1CNTHbits_t I2C1CNTHbits __at(0x28D);
// bitfield macros
#define _I2C1CNTH_CNT_POSN                                  0x0
#define _I2C1CNTH_CNT_POSITION                              0x0
#define _I2C1CNTH_CNT_SIZE                                  0x8
#define _I2C1CNTH_CNT_LENGTH                                0x8
#define _I2C1CNTH_CNT_MASK                                  0xFF
#define _I2C1CNTH_CNT8_POSN                                 0x0
#define _I2C1CNTH_CNT8_POSITION                             0x0
#define _I2C1CNTH_CNT8_SIZE                                 0x1
#define _I2C1CNTH_CNT8_LENGTH                               0x1
#define _I2C1CNTH_CNT8_MASK                                 0x1
#define _I2C1CNTH_CNT9_POSN                                 0x1
#define _I2C1CNTH_CNT9_POSITION                             0x1
#define _I2C1CNTH_CNT9_SIZE                                 0x1
#define _I2C1CNTH_CNT9_LENGTH                               0x1
#define _I2C1CNTH_CNT9_MASK                                 0x2
#define _I2C1CNTH_CNT10_POSN                                0x2
#define _I2C1CNTH_CNT10_POSITION                            0x2
#define _I2C1CNTH_CNT10_SIZE                                0x1
#define _I2C1CNTH_CNT10_LENGTH                              0x1
#define _I2C1CNTH_CNT10_MASK                                0x4
#define _I2C1CNTH_CNT11_POSN                                0x3
#define _I2C1CNTH_CNT11_POSITION                            0x3
#define _I2C1CNTH_CNT11_SIZE                                0x1
#define _I2C1CNTH_CNT11_LENGTH                              0x1
#define _I2C1CNTH_CNT11_MASK                                0x8
#define _I2C1CNTH_CNT12_POSN                                0x4
#define _I2C1CNTH_CNT12_POSITION                            0x4
#define _I2C1CNTH_CNT12_SIZE                                0x1
#define _I2C1CNTH_CNT12_LENGTH                              0x1
#define _I2C1CNTH_CNT12_MASK                                0x10
#define _I2C1CNTH_CNT13_POSN                                0x5
#define _I2C1CNTH_CNT13_POSITION                            0x5
#define _I2C1CNTH_CNT13_SIZE                                0x1
#define _I2C1CNTH_CNT13_LENGTH                              0x1
#define _I2C1CNTH_CNT13_MASK                                0x20
#define _I2C1CNTH_CNT14_POSN                                0x6
#define _I2C1CNTH_CNT14_POSITION                            0x6
#define _I2C1CNTH_CNT14_SIZE                                0x1
#define _I2C1CNTH_CNT14_LENGTH                              0x1
#define _I2C1CNTH_CNT14_MASK                                0x40
#define _I2C1CNTH_CNT15_POSN                                0x7
#define _I2C1CNTH_CNT15_POSITION                            0x7
#define _I2C1CNTH_CNT15_SIZE                                0x1
#define _I2C1CNTH_CNT15_LENGTH                              0x1
#define _I2C1CNTH_CNT15_MASK                                0x80

// Register: I2C1ADB0
#define I2C1ADB0 I2C1ADB0
extern volatile unsigned char           I2C1ADB0            __at(0x28E);
#ifndef _LIB_BUILD
asm("I2C1ADB0 equ 028Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C1ADB0bits_t;
extern volatile I2C1ADB0bits_t I2C1ADB0bits __at(0x28E);
// bitfield macros
#define _I2C1ADB0_ADB_POSN                                  0x0
#define _I2C1ADB0_ADB_POSITION                              0x0
#define _I2C1ADB0_ADB_SIZE                                  0x8
#define _I2C1ADB0_ADB_LENGTH                                0x8
#define _I2C1ADB0_ADB_MASK                                  0xFF

// Register: I2C1ADB1
#define I2C1ADB1 I2C1ADB1
extern volatile unsigned char           I2C1ADB1            __at(0x28F);
#ifndef _LIB_BUILD
asm("I2C1ADB1 equ 028Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C1ADB1bits_t;
extern volatile I2C1ADB1bits_t I2C1ADB1bits __at(0x28F);
// bitfield macros
#define _I2C1ADB1_ADB_POSN                                  0x0
#define _I2C1ADB1_ADB_POSITION                              0x0
#define _I2C1ADB1_ADB_SIZE                                  0x8
#define _I2C1ADB1_ADB_LENGTH                                0x8
#define _I2C1ADB1_ADB_MASK                                  0xFF

// Register: I2C1ADR0
#define I2C1ADR0 I2C1ADR0
extern volatile unsigned char           I2C1ADR0            __at(0x290);
#ifndef _LIB_BUILD
asm("I2C1ADR0 equ 0290h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C1ADR0bits_t;
extern volatile I2C1ADR0bits_t I2C1ADR0bits __at(0x290);
// bitfield macros
#define _I2C1ADR0_ADR_POSN                                  0x0
#define _I2C1ADR0_ADR_POSITION                              0x0
#define _I2C1ADR0_ADR_SIZE                                  0x8
#define _I2C1ADR0_ADR_LENGTH                                0x8
#define _I2C1ADR0_ADR_MASK                                  0xFF

// Register: I2C1ADR1
#define I2C1ADR1 I2C1ADR1
extern volatile unsigned char           I2C1ADR1            __at(0x291);
#ifndef _LIB_BUILD
asm("I2C1ADR1 equ 0291h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C1ADR1bits_t;
extern volatile I2C1ADR1bits_t I2C1ADR1bits __at(0x291);
// bitfield macros
#define _I2C1ADR1_ADR_POSN                                  0x1
#define _I2C1ADR1_ADR_POSITION                              0x1
#define _I2C1ADR1_ADR_SIZE                                  0x7
#define _I2C1ADR1_ADR_LENGTH                                0x7
#define _I2C1ADR1_ADR_MASK                                  0xFE

// Register: I2C1ADR2
#define I2C1ADR2 I2C1ADR2
extern volatile unsigned char           I2C1ADR2            __at(0x292);
#ifndef _LIB_BUILD
asm("I2C1ADR2 equ 0292h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C1ADR2bits_t;
extern volatile I2C1ADR2bits_t I2C1ADR2bits __at(0x292);
// bitfield macros
#define _I2C1ADR2_ADR_POSN                                  0x0
#define _I2C1ADR2_ADR_POSITION                              0x0
#define _I2C1ADR2_ADR_SIZE                                  0x8
#define _I2C1ADR2_ADR_LENGTH                                0x8
#define _I2C1ADR2_ADR_MASK                                  0xFF

// Register: I2C1ADR3
#define I2C1ADR3 I2C1ADR3
extern volatile unsigned char           I2C1ADR3            __at(0x293);
#ifndef _LIB_BUILD
asm("I2C1ADR3 equ 0293h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C1ADR3bits_t;
