GopalSaraf/Practicals/PSDL/include/proc/pic18f06q41.h
extern volatile PWM2S1P1Hbits_t PWM2S1P1Hbits __at(0x47B);
// bitfield macros
#define _PWM2S1P1H_S1P1H_POSN                               0x0
#define _PWM2S1P1H_S1P1H_POSITION                           0x0
#define _PWM2S1P1H_S1P1H_SIZE                               0x8
#define _PWM2S1P1H_S1P1H_LENGTH                             0x8
#define _PWM2S1P1H_S1P1H_MASK                               0xFF

// Register: PWM2S1P2
#define PWM2S1P2 PWM2S1P2
extern volatile unsigned short          PWM2S1P2            __at(0x47C);
#ifndef _LIB_BUILD
asm("PWM2S1P2 equ 047Ch");
#endif

// Register: PWM2S1P2L
#define PWM2S1P2L PWM2S1P2L
extern volatile unsigned char           PWM2S1P2L           __at(0x47C);
#ifndef _LIB_BUILD
asm("PWM2S1P2L equ 047Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P2L                  :8;
    };
} PWM2S1P2Lbits_t;
extern volatile PWM2S1P2Lbits_t PWM2S1P2Lbits __at(0x47C);
// bitfield macros
#define _PWM2S1P2L_S1P2L_POSN                               0x0
#define _PWM2S1P2L_S1P2L_POSITION                           0x0
#define _PWM2S1P2L_S1P2L_SIZE                               0x8
#define _PWM2S1P2L_S1P2L_LENGTH                             0x8
#define _PWM2S1P2L_S1P2L_MASK                               0xFF

// Register: PWM2S1P2H
#define PWM2S1P2H PWM2S1P2H
extern volatile unsigned char           PWM2S1P2H           __at(0x47D);
#ifndef _LIB_BUILD
asm("PWM2S1P2H equ 047Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P2H                  :8;
    };
} PWM2S1P2Hbits_t;
extern volatile PWM2S1P2Hbits_t PWM2S1P2Hbits __at(0x47D);
// bitfield macros
#define _PWM2S1P2H_S1P2H_POSN                               0x0
#define _PWM2S1P2H_S1P2H_POSITION                           0x0
#define _PWM2S1P2H_S1P2H_SIZE                               0x8
#define _PWM2S1P2H_S1P2H_LENGTH                             0x8
#define _PWM2S1P2H_S1P2H_MASK                               0xFF

// Register: PWM3ERS
#define PWM3ERS PWM3ERS
extern volatile unsigned char           PWM3ERS             __at(0x47E);
#ifndef _LIB_BUILD
asm("PWM3ERS equ 047Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
        unsigned ERS4                   :1;
        unsigned ERS5                   :1;
        unsigned ERS6                   :1;
        unsigned ERS7                   :1;
    };
} PWM3ERSbits_t;
extern volatile PWM3ERSbits_t PWM3ERSbits __at(0x47E);
// bitfield macros
#define _PWM3ERS_ERS_POSN                                   0x0
#define _PWM3ERS_ERS_POSITION                               0x0
#define _PWM3ERS_ERS_SIZE                                   0x8
#define _PWM3ERS_ERS_LENGTH                                 0x8
#define _PWM3ERS_ERS_MASK                                   0xFF
#define _PWM3ERS_ERS0_POSN                                  0x0
#define _PWM3ERS_ERS0_POSITION                              0x0
#define _PWM3ERS_ERS0_SIZE                                  0x1
#define _PWM3ERS_ERS0_LENGTH                                0x1
#define _PWM3ERS_ERS0_MASK                                  0x1
#define _PWM3ERS_ERS1_POSN                                  0x1
#define _PWM3ERS_ERS1_POSITION                              0x1
#define _PWM3ERS_ERS1_SIZE                                  0x1
#define _PWM3ERS_ERS1_LENGTH                                0x1
#define _PWM3ERS_ERS1_MASK                                  0x2
#define _PWM3ERS_ERS2_POSN                                  0x2
#define _PWM3ERS_ERS2_POSITION                              0x2
#define _PWM3ERS_ERS2_SIZE                                  0x1
#define _PWM3ERS_ERS2_LENGTH                                0x1
#define _PWM3ERS_ERS2_MASK                                  0x4
#define _PWM3ERS_ERS3_POSN                                  0x3
#define _PWM3ERS_ERS3_POSITION                              0x3
#define _PWM3ERS_ERS3_SIZE                                  0x1
#define _PWM3ERS_ERS3_LENGTH                                0x1
#define _PWM3ERS_ERS3_MASK                                  0x8
#define _PWM3ERS_ERS4_POSN                                  0x4
#define _PWM3ERS_ERS4_POSITION                              0x4
#define _PWM3ERS_ERS4_SIZE                                  0x1
#define _PWM3ERS_ERS4_LENGTH                                0x1
#define _PWM3ERS_ERS4_MASK                                  0x10
#define _PWM3ERS_ERS5_POSN                                  0x5
#define _PWM3ERS_ERS5_POSITION                              0x5
#define _PWM3ERS_ERS5_SIZE                                  0x1
#define _PWM3ERS_ERS5_LENGTH                                0x1
#define _PWM3ERS_ERS5_MASK                                  0x20
#define _PWM3ERS_ERS6_POSN                                  0x6
#define _PWM3ERS_ERS6_POSITION                              0x6
#define _PWM3ERS_ERS6_SIZE                                  0x1
#define _PWM3ERS_ERS6_LENGTH                                0x1
#define _PWM3ERS_ERS6_MASK                                  0x40
#define _PWM3ERS_ERS7_POSN                                  0x7
#define _PWM3ERS_ERS7_POSITION                              0x7
#define _PWM3ERS_ERS7_SIZE                                  0x1
#define _PWM3ERS_ERS7_LENGTH                                0x1
#define _PWM3ERS_ERS7_MASK                                  0x80

// Register: PWM3CLK
#define PWM3CLK PWM3CLK
extern volatile unsigned char           PWM3CLK             __at(0x47F);
#ifndef _LIB_BUILD
asm("PWM3CLK equ 047Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
        unsigned CLK5                   :1;
        unsigned CLK6                   :1;
        unsigned CLK7                   :1;
    };
} PWM3CLKbits_t;
extern volatile PWM3CLKbits_t PWM3CLKbits __at(0x47F);
// bitfield macros
#define _PWM3CLK_CLK_POSN                                   0x0
#define _PWM3CLK_CLK_POSITION                               0x0
#define _PWM3CLK_CLK_SIZE                                   0x8
#define _PWM3CLK_CLK_LENGTH                                 0x8
#define _PWM3CLK_CLK_MASK                                   0xFF
#define _PWM3CLK_CLK0_POSN                                  0x0
#define _PWM3CLK_CLK0_POSITION                              0x0
#define _PWM3CLK_CLK0_SIZE                                  0x1
#define _PWM3CLK_CLK0_LENGTH                                0x1
#define _PWM3CLK_CLK0_MASK                                  0x1
#define _PWM3CLK_CLK1_POSN                                  0x1
#define _PWM3CLK_CLK1_POSITION                              0x1
#define _PWM3CLK_CLK1_SIZE                                  0x1
#define _PWM3CLK_CLK1_LENGTH                                0x1
#define _PWM3CLK_CLK1_MASK                                  0x2
#define _PWM3CLK_CLK2_POSN                                  0x2
#define _PWM3CLK_CLK2_POSITION                              0x2
#define _PWM3CLK_CLK2_SIZE                                  0x1
#define _PWM3CLK_CLK2_LENGTH                                0x1
#define _PWM3CLK_CLK2_MASK                                  0x4
#define _PWM3CLK_CLK3_POSN                                  0x3
#define _PWM3CLK_CLK3_POSITION                              0x3
#define _PWM3CLK_CLK3_SIZE                                  0x1
#define _PWM3CLK_CLK3_LENGTH                                0x1
#define _PWM3CLK_CLK3_MASK                                  0x8
#define _PWM3CLK_CLK4_POSN                                  0x4
#define _PWM3CLK_CLK4_POSITION                              0x4
#define _PWM3CLK_CLK4_SIZE                                  0x1
#define _PWM3CLK_CLK4_LENGTH                                0x1
#define _PWM3CLK_CLK4_MASK                                  0x10
#define _PWM3CLK_CLK5_POSN                                  0x5
#define _PWM3CLK_CLK5_POSITION                              0x5
#define _PWM3CLK_CLK5_SIZE                                  0x1
#define _PWM3CLK_CLK5_LENGTH                                0x1
#define _PWM3CLK_CLK5_MASK                                  0x20
#define _PWM3CLK_CLK6_POSN                                  0x6
#define _PWM3CLK_CLK6_POSITION                              0x6
#define _PWM3CLK_CLK6_SIZE                                  0x1
#define _PWM3CLK_CLK6_LENGTH                                0x1
#define _PWM3CLK_CLK6_MASK                                  0x40
#define _PWM3CLK_CLK7_POSN                                  0x7
#define _PWM3CLK_CLK7_POSITION                              0x7
#define _PWM3CLK_CLK7_SIZE                                  0x1
#define _PWM3CLK_CLK7_LENGTH                                0x1
#define _PWM3CLK_CLK7_MASK                                  0x80

// Register: PWM3LDS
#define PWM3LDS PWM3LDS
extern volatile unsigned char           PWM3LDS             __at(0x480);
#ifndef _LIB_BUILD
asm("PWM3LDS equ 0480h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :8;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
        unsigned LDS2                   :1;
        unsigned LDS3                   :1;
        unsigned LDS4                   :1;
        unsigned LDS5                   :1;
        unsigned LDS6                   :1;
        unsigned LDS7                   :1;
    };
} PWM3LDSbits_t;
extern volatile PWM3LDSbits_t PWM3LDSbits __at(0x480);
// bitfield macros
#define _PWM3LDS_LDS_POSN                                   0x0
#define _PWM3LDS_LDS_POSITION                               0x0
#define _PWM3LDS_LDS_SIZE                                   0x8
#define _PWM3LDS_LDS_LENGTH                                 0x8
#define _PWM3LDS_LDS_MASK                                   0xFF
#define _PWM3LDS_LDS0_POSN                                  0x0
#define _PWM3LDS_LDS0_POSITION                              0x0
#define _PWM3LDS_LDS0_SIZE                                  0x1
#define _PWM3LDS_LDS0_LENGTH                                0x1
#define _PWM3LDS_LDS0_MASK                                  0x1
#define _PWM3LDS_LDS1_POSN                                  0x1
#define _PWM3LDS_LDS1_POSITION                              0x1
#define _PWM3LDS_LDS1_SIZE                                  0x1
#define _PWM3LDS_LDS1_LENGTH                                0x1
#define _PWM3LDS_LDS1_MASK                                  0x2
#define _PWM3LDS_LDS2_POSN                                  0x2
#define _PWM3LDS_LDS2_POSITION                              0x2
#define _PWM3LDS_LDS2_SIZE                                  0x1
#define _PWM3LDS_LDS2_LENGTH                                0x1
#define _PWM3LDS_LDS2_MASK                                  0x4
#define _PWM3LDS_LDS3_POSN                                  0x3
#define _PWM3LDS_LDS3_POSITION                              0x3
#define _PWM3LDS_LDS3_SIZE                                  0x1
#define _PWM3LDS_LDS3_LENGTH                                0x1
#define _PWM3LDS_LDS3_MASK                                  0x8
#define _PWM3LDS_LDS4_POSN                                  0x4
#define _PWM3LDS_LDS4_POSITION                              0x4
#define _PWM3LDS_LDS4_SIZE                                  0x1
#define _PWM3LDS_LDS4_LENGTH                                0x1
#define _PWM3LDS_LDS4_MASK                                  0x10
#define _PWM3LDS_LDS5_POSN                                  0x5
#define _PWM3LDS_LDS5_POSITION                              0x5
#define _PWM3LDS_LDS5_SIZE                                  0x1
#define _PWM3LDS_LDS5_LENGTH                                0x1
#define _PWM3LDS_LDS5_MASK                                  0x20
#define _PWM3LDS_LDS6_POSN                                  0x6
#define _PWM3LDS_LDS6_POSITION                              0x6
#define _PWM3LDS_LDS6_SIZE                                  0x1
#define _PWM3LDS_LDS6_LENGTH                                0x1
#define _PWM3LDS_LDS6_MASK                                  0x40
#define _PWM3LDS_LDS7_POSN                                  0x7
#define _PWM3LDS_LDS7_POSITION                              0x7
#define _PWM3LDS_LDS7_SIZE                                  0x1
#define _PWM3LDS_LDS7_LENGTH                                0x1
#define _PWM3LDS_LDS7_MASK                                  0x80

// Register: PWM3PR
#define PWM3PR PWM3PR
extern volatile unsigned short          PWM3PR              __at(0x481);
#ifndef _LIB_BUILD
asm("PWM3PR equ 0481h");
#endif

