GopalSaraf/Practicals/PSDL/include/proc/pic18f06q41.h
extern volatile __bit                   CLCIN1PPS2          __at(0x1312);	// @ (0x262 * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0x1313);	// @ (0x262 * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0x1314);	// @ (0x262 * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN1PPS<CLCIN1PPS5>
extern volatile __bit                   CLCIN1PPS5          __at(0x1315);	// @ (0x262 * 8 + 5)
#define                                 CLCIN1PPS5_bit      _BIT_ACCESS(CLCIN1PPS,5)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0x1318);	// @ (0x263 * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0x1319);	// @ (0x263 * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0x131A);	// @ (0x263 * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0x131B);	// @ (0x263 * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0x131C);	// @ (0x263 * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN2PPS<CLCIN2PPS5>
extern volatile __bit                   CLCIN2PPS5          __at(0x131D);	// @ (0x263 * 8 + 5)
#define                                 CLCIN2PPS5_bit      _BIT_ACCESS(CLCIN2PPS,5)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0x1320);	// @ (0x264 * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0x1321);	// @ (0x264 * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0x1322);	// @ (0x264 * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0x1323);	// @ (0x264 * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0x1324);	// @ (0x264 * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// CLCIN3PPS<CLCIN3PPS5>
extern volatile __bit                   CLCIN3PPS5          __at(0x1325);	// @ (0x264 * 8 + 5)
#define                                 CLCIN3PPS5_bit      _BIT_ACCESS(CLCIN3PPS,5)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x1D0);	// @ (0x3A * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x1D1);	// @ (0x3A * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x1D2);	// @ (0x3A * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x1D3);	// @ (0x3A * 8 + 3)
#define                                 CLKRCLK3_bit        _BIT_ACCESS(CLKRCLK,3)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x1CB);	// @ (0x39 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x1CC);	// @ (0x39 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x1C8);	// @ (0x39 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x1C9);	// @ (0x39 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x1CA);	// @ (0x39 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x1CF);	// @ (0x39 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x319);	// @ (0x63 * 8 + 1)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,1)
// MD1CON1<CLPOL>
extern volatile __bit                   CLPOL               __at(0x359);	// @ (0x6B * 8 + 1)
#define                                 CLPOL_bit           _BIT_ACCESS(MD1CON1,1)
// MD1CON1<CLSYNC>
extern volatile __bit                   CLSYNC              __at(0x358);	// @ (0x6B * 8 + 0)
#define                                 CLSYNC_bit          _BIT_ACCESS(MD1CON1,0)
// PIE1<CM1IE>
extern volatile __bit                   CM1IE               __at(0x254C);	// @ (0x4A9 * 8 + 4)
#define                                 CM1IE_bit           _BIT_ACCESS(PIE1,4)
// PIR1<CM1IF>
extern volatile __bit                   CM1IF               __at(0x25A4);	// @ (0x4B4 * 8 + 4)
#define                                 CM1IF_bit           _BIT_ACCESS(PIR1,4)
// IPR1<CM1IP>
extern volatile __bit                   CM1IP               __at(0x1B44);	// @ (0x368 * 8 + 4)
#define                                 CM1IP_bit           _BIT_ACCESS(IPR1,4)
// PMD1<CM1MD>
extern volatile __bit                   CM1MD               __at(0x327);	// @ (0x64 * 8 + 7)
#define                                 CM1MD_bit           _BIT_ACCESS(PMD1,7)
// PIE5<CM2IE>
extern volatile __bit                   CM2IE               __at(0x256C);	// @ (0x4AD * 8 + 4)
#define                                 CM2IE_bit           _BIT_ACCESS(PIE5,4)
// PIR5<CM2IF>
extern volatile __bit                   CM2IF               __at(0x25C4);	// @ (0x4B8 * 8 + 4)
#define                                 CM2IF_bit           _BIT_ACCESS(PIR5,4)
// IPR5<CM2IP>
extern volatile __bit                   CM2IP               __at(0x1B64);	// @ (0x36C * 8 + 4)
#define                                 CM2IP_bit           _BIT_ACCESS(IPR5,4)
// PMD2<CM2MD>
extern volatile __bit                   CM2MD               __at(0x328);	// @ (0x65 * 8 + 0)
#define                                 CM2MD_bit           _BIT_ACCESS(PMD2,0)
// I2C1CNTH<CNT10>
extern volatile __bit                   CNT10               __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 CNT10_bit           _BIT_ACCESS(I2C1CNTH,2)
// I2C1CNTH<CNT11>
extern volatile __bit                   CNT11               __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 CNT11_bit           _BIT_ACCESS(I2C1CNTH,3)
// I2C1CNTH<CNT12>
extern volatile __bit                   CNT12               __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 CNT12_bit           _BIT_ACCESS(I2C1CNTH,4)
// I2C1CNTH<CNT13>
extern volatile __bit                   CNT13               __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 CNT13_bit           _BIT_ACCESS(I2C1CNTH,5)
// I2C1CNTH<CNT14>
extern volatile __bit                   CNT14               __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 CNT14_bit           _BIT_ACCESS(I2C1CNTH,6)
// I2C1CNTH<CNT15>
extern volatile __bit                   CNT15               __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 CNT15_bit           _BIT_ACCESS(I2C1CNTH,7)
// I2C1PIE<CNT1IE>
extern volatile __bit                   CNT1IE              __at(0x14DF);	// @ (0x29B * 8 + 7)
#define                                 CNT1IE_bit          _BIT_ACCESS(I2C1PIE,7)
// I2C1PIR<CNT1IF>
extern volatile __bit                   CNT1IF              __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 CNT1IF_bit          _BIT_ACCESS(I2C1PIR,7)
// I2C1CNTH<CNT8>
extern volatile __bit                   CNT8                __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 CNT8_bit            _BIT_ACCESS(I2C1CNTH,0)
// I2C1CNTH<CNT9>
extern volatile __bit                   CNT9                __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 CNT9_bit            _BIT_ACCESS(I2C1CNTH,1)
// I2C1PIE<CNTIE>
extern volatile __bit                   CNTIE               __at(0x14DF);	// @ (0x29B * 8 + 7)
#define                                 CNTIE_bit           _BIT_ACCESS(I2C1PIE,7)
// I2C1PIR<CNTIF>
extern volatile __bit                   CNTIF               __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 CNTIF_bit           _BIT_ACCESS(I2C1PIR,7)
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0x1F9E);	// @ (0x3F3 * 8 + 6)
#define                                 CONT_bit            _BIT_ACCESS(ADCON0,6)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x574);	// @ (0xAE * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x575);	// @ (0xAE * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x576);	// @ (0xAE * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// SMT1CON0<CPOL>
extern volatile __bit                   CPOL                __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 CPOL_bit            _BIT_ACCESS(SMT1CON0,2)
// ADCPCON<CPRDY>
extern volatile __bit                   CPRDY               __at(0x1EC0);	// @ (0x3D8 * 8 + 0)
#define                                 CPRDY_bit           _BIT_ACCESS(ADCPCON,0)
// SMT1STAT<CPRUP>
extern volatile __bit                   CPRUP               __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 CPRUP_bit           _BIT_ACCESS(SMT1STAT,7)
// SMT1STAT<CPWUP>
extern volatile __bit                   CPWUP               __at(0x1876);	// @ (0x30E * 8 + 6)
#define                                 CPWUP_bit           _BIT_ACCESS(SMT1STAT,6)
// CRCCON0<CRCBUSY>
extern volatile __bit                   CRCBUSY             __at(0x1AB5);	// @ (0x356 * 8 + 5)
#define                                 CRCBUSY_bit         _BIT_ACCESS(CRCCON0,5)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0x1AB7);	// @ (0x356 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0x1AB6);	// @ (0x356 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE0<CRCIE>
extern volatile __bit                   CRCIE               __at(0x2546);	// @ (0x4A8 * 8 + 6)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE0,6)
// PIR0<CRCIF>
extern volatile __bit                   CRCIF               __at(0x259E);	// @ (0x4B3 * 8 + 6)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR0,6)
// IPR0<CRCIP>
extern volatile __bit                   CRCIP               __at(0x1B3E);	// @ (0x367 * 8 + 6)
#define                                 CRCIP_bit           _BIT_ACCESS(IPR0,6)
// PMD0<CRCMD>
extern volatile __bit                   CRCMD               __at(0x31C);	// @ (0x63 * 8 + 4)
#define                                 CRCMD_bit           _BIT_ACCESS(PMD0,4)
// ADCON2<CRS0>
extern volatile __bit                   CRS0                __at(0x1FAC);	// @ (0x3F5 * 8 + 4)
#define                                 CRS0_bit            _BIT_ACCESS(ADCON2,4)
// ADCON2<CRS1>
extern volatile __bit                   CRS1                __at(0x1FAD);	// @ (0x3F5 * 8 + 5)
#define                                 CRS1_bit            _BIT_ACCESS(ADCON2,5)
// ADCON2<CRS2>
extern volatile __bit                   CRS2                __at(0x1FAE);	// @ (0x3F5 * 8 + 6)
#define                                 CRS2_bit            _BIT_ACCESS(ADCON2,6)
// ADCLK<CS5>
extern volatile __bit                   CS5                 __at(0x1FD5);	// @ (0x3FA * 8 + 5)
#define                                 CS5_bit             _BIT_ACCESS(ADCLK,5)
// I2C1CON1<CSD>
extern volatile __bit                   CSD                 __at(0x14A8);	// @ (0x295 * 8 + 0)
#define                                 CSD_bit             _BIT_ACCESS(I2C1CON1,0)
// SMT1CLK<CSEL0>
extern volatile __bit                   CSEL0               __at(0x1878);	// @ (0x30F * 8 + 0)
#define                                 CSEL0_bit           _BIT_ACCESS(SMT1CLK,0)
// SMT1CLK<CSEL1>
extern volatile __bit                   CSEL1               __at(0x1879);	// @ (0x30F * 8 + 1)
#define                                 CSEL1_bit           _BIT_ACCESS(SMT1CLK,1)
// SMT1CLK<CSEL2>
extern volatile __bit                   CSEL2               __at(0x187A);	// @ (0x30F * 8 + 2)
#define                                 CSEL2_bit           _BIT_ACCESS(SMT1CLK,2)
// SMT1CLK<CSEL3>
extern volatile __bit                   CSEL3               __at(0x187B);	// @ (0x30F * 8 + 3)
#define                                 CSEL3_bit           _BIT_ACCESS(SMT1CLK,3)
// I2C1CON0<CSTR>
extern volatile __bit                   CSTR                __at(0x14A4);	// @ (0x294 * 8 + 4)
#define                                 CSTR_bit            _BIT_ACCESS(I2C1CON0,4)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x57F);	// @ (0xAF * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE0<CSWIE>
extern volatile __bit                   CSWIE               __at(0x2543);	// @ (0x4A8 * 8 + 3)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE0,3)
// PIR0<CSWIF>
extern volatile __bit                   CSWIF               __at(0x259B);	// @ (0x4B3 * 8 + 3)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR0,3)
// IPR0<CSWIP>
extern volatile __bit                   CSWIP               __at(0x1B3B);	// @ (0x367 * 8 + 3)
#define                                 CSWIP_bit           _BIT_ACCESS(IPR0,3)
// CCP1CAP<CTS0>
extern volatile __bit                   CTS0                __at(0x1A18);	// @ (0x343 * 8 + 0)
#define                                 CTS0_bit            _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CTS1>
extern volatile __bit                   CTS1                __at(0x1A19);	// @ (0x343 * 8 + 1)
#define                                 CTS1_bit            _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CTS2>
extern volatile __bit                   CTS2                __at(0x1A1A);	// @ (0x343 * 8 + 2)
#define                                 CTS2_bit            _BIT_ACCESS(CCP1CAP,2)
// CWG1CLK<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x1DE0);	// @ (0x3BC * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLK,0)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x1DF8);	// @ (0x3BF * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x1DF9);	// @ (0x3BF * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x1DFA);	// @ (0x3BF * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x1DFB);	// @ (0x3BF * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x1DFC);	// @ (0x3BF * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x1DFD);	// @ (0x3BF * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x1DF0);	// @ (0x3BE * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x1DF1);	// @ (0x3BE * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x1DF2);	// @ (0x3BE * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x1DF3);	// @ (0x3BE * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x1DF4);	// @ (0x3BE * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x1DF5);	// @ (0x3BE * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x1E07);	// @ (0x3C0 * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE6<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x2572);	// @ (0x4AE * 8 + 2)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE6,2)
// PIR6<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0x25CA);	// @ (0x4B9 * 8 + 2)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR6,2)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x1E0D);	// @ (0x3C1 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1PPS<CWG1INPPS0>
extern volatile __bit                   CWG1INPPS0          __at(0x12D8);	// @ (0x25B * 8 + 0)
#define                                 CWG1INPPS0_bit      _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWG1INPPS1>
extern volatile __bit                   CWG1INPPS1          __at(0x12D9);	// @ (0x25B * 8 + 1)
#define                                 CWG1INPPS1_bit      _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWG1INPPS2>
extern volatile __bit                   CWG1INPPS2          __at(0x12DA);	// @ (0x25B * 8 + 2)
#define                                 CWG1INPPS2_bit      _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWG1INPPS3>
extern volatile __bit                   CWG1INPPS3          __at(0x12DB);	// @ (0x25B * 8 + 3)
#define                                 CWG1INPPS3_bit      _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWG1INPPS4>
extern volatile __bit                   CWG1INPPS4          __at(0x12DC);	// @ (0x25B * 8 + 4)
#define                                 CWG1INPPS4_bit      _BIT_ACCESS(CWG1PPS,4)
// CWG1PPS<CWG1INPPS5>
extern volatile __bit                   CWG1INPPS5          __at(0x12DD);	// @ (0x25B * 8 + 5)
#define                                 CWG1INPPS5_bit      _BIT_ACCESS(CWG1PPS,5)
// IPR6<CWG1IP>
extern volatile __bit                   CWG1IP              __at(0x1B6A);	// @ (0x36D * 8 + 2)
#define                                 CWG1IP_bit          _BIT_ACCESS(IPR6,2)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x1E06);	// @ (0x3C0 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x1E12);	// @ (0x3C2 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x1E13);	// @ (0x3C2 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x1E14);	// @ (0x3C2 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x1E15);	// @ (0x3C2 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// CWG1AS0<CWG1LSDB0>
extern volatile __bit                   CWG1LSDB0           __at(0x1E14);	// @ (0x3C2 * 8 + 4)
#define                                 CWG1LSDB0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSDB1>
extern volatile __bit                   CWG1LSDB1           __at(0x1E15);	// @ (0x3C2 * 8 + 5)
#define                                 CWG1LSDB1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD2<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x32E);	// @ (0x65 * 8 + 6)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD2,6)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x1E00);	// @ (0x3C0 * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x1E01);	// @ (0x3C0 * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x1E02);	// @ (0x3C0 * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x1E24);	// @ (0x3C4 * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x1E25);	// @ (0x3C4 * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x1E26);	// @ (0x3C4 * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x1E27);	// @ (0x3C4 * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x1E08);	// @ (0x3C1 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x1E09);	// @ (0x3C1 * 8 + 1)
