GopalSaraf/Practicals/PSDL/include/proc/pic18f06q41.h
extern volatile __bit                   DCNT8               __at(0x758);	// @ (0xEB * 8 + 0)
#define                                 DCNT8_bit           _BIT_ACCESS(DMAnDCNTH,0)
// DMAnDCNTH<DCNT9>
extern volatile __bit                   DCNT9               __at(0x759);	// @ (0xEB * 8 + 1)
#define                                 DCNT9_bit           _BIT_ACCESS(DMAnDCNTH,1)
// DMAnCON0<DGO>
extern volatile __bit                   DGO                 __at(0x7E5);	// @ (0xFC * 8 + 5)
#define                                 DGO_bit             _BIT_ACCESS(DMAnCON0,5)
// CLKRCON<DIV0>
extern volatile __bit                   DIV0                __at(0x1C8);	// @ (0x39 * 8 + 0)
#define                                 DIV0_bit            _BIT_ACCESS(CLKRCON,0)
// CLKRCON<DIV1>
extern volatile __bit                   DIV1                __at(0x1C9);	// @ (0x39 * 8 + 1)
#define                                 DIV1_bit            _BIT_ACCESS(CLKRCON,1)
// CLKRCON<DIV2>
extern volatile __bit                   DIV2                __at(0x1CA);	// @ (0x39 * 8 + 2)
#define                                 DIV2_bit            _BIT_ACCESS(CLKRCON,2)
// CRCCON2<DLEN0>
extern volatile __bit                   DLEN0               __at(0x1AC0);	// @ (0x358 * 8 + 0)
#define                                 DLEN0_bit           _BIT_ACCESS(CRCCON2,0)
// CRCCON2<DLEN1>
extern volatile __bit                   DLEN1               __at(0x1AC1);	// @ (0x358 * 8 + 1)
#define                                 DLEN1_bit           _BIT_ACCESS(CRCCON2,1)
// CRCCON2<DLEN2>
extern volatile __bit                   DLEN2               __at(0x1AC2);	// @ (0x358 * 8 + 2)
#define                                 DLEN2_bit           _BIT_ACCESS(CRCCON2,2)
// CRCCON2<DLEN3>
extern volatile __bit                   DLEN3               __at(0x1AC3);	// @ (0x358 * 8 + 3)
#define                                 DLEN3_bit           _BIT_ACCESS(CRCCON2,3)
// CRCCON2<DLEN4>
extern volatile __bit                   DLEN4               __at(0x1AC4);	// @ (0x358 * 8 + 4)
#define                                 DLEN4_bit           _BIT_ACCESS(CRCCON2,4)
// PIE2<DMA1AIE>
extern volatile __bit                   DMA1AIE             __at(0x2557);	// @ (0x4AA * 8 + 7)
#define                                 DMA1AIE_bit         _BIT_ACCESS(PIE2,7)
// PIR2<DMA1AIF>
extern volatile __bit                   DMA1AIF             __at(0x25AF);	// @ (0x4B5 * 8 + 7)
#define                                 DMA1AIF_bit         _BIT_ACCESS(PIR2,7)
// IPR2<DMA1AIP>
extern volatile __bit                   DMA1AIP             __at(0x1B4F);	// @ (0x369 * 8 + 7)
#define                                 DMA1AIP_bit         _BIT_ACCESS(IPR2,7)
// PIE2<DMA1DCNTIE>
extern volatile __bit                   DMA1DCNTIE          __at(0x2555);	// @ (0x4AA * 8 + 5)
#define                                 DMA1DCNTIE_bit      _BIT_ACCESS(PIE2,5)
// PIR2<DMA1DCNTIF>
extern volatile __bit                   DMA1DCNTIF          __at(0x25AD);	// @ (0x4B5 * 8 + 5)
#define                                 DMA1DCNTIF_bit      _BIT_ACCESS(PIR2,5)
// IPR2<DMA1DCNTIP>
extern volatile __bit                   DMA1DCNTIP          __at(0x1B4D);	// @ (0x369 * 8 + 5)
#define                                 DMA1DCNTIP_bit      _BIT_ACCESS(IPR2,5)
// PMD4<DMA1MD>
extern volatile __bit                   DMA1MD              __at(0x33D);	// @ (0x67 * 8 + 5)
#define                                 DMA1MD_bit          _BIT_ACCESS(PMD4,5)
// PIE2<DMA1ORIE>
extern volatile __bit                   DMA1ORIE            __at(0x2556);	// @ (0x4AA * 8 + 6)
#define                                 DMA1ORIE_bit        _BIT_ACCESS(PIE2,6)
// PIR2<DMA1ORIF>
extern volatile __bit                   DMA1ORIF            __at(0x25AE);	// @ (0x4B5 * 8 + 6)
#define                                 DMA1ORIF_bit        _BIT_ACCESS(PIR2,6)
// IPR2<DMA1ORIP>
extern volatile __bit                   DMA1ORIP            __at(0x1B4E);	// @ (0x369 * 8 + 6)
#define                                 DMA1ORIP_bit        _BIT_ACCESS(IPR2,6)
// DMA1PR<DMA1PR0>
extern volatile __bit                   DMA1PR0             __at(0x5B0);	// @ (0xB6 * 8 + 0)
#define                                 DMA1PR0_bit         _BIT_ACCESS(DMA1PR,0)
// DMA1PR<DMA1PR1>
extern volatile __bit                   DMA1PR1             __at(0x5B1);	// @ (0xB6 * 8 + 1)
#define                                 DMA1PR1_bit         _BIT_ACCESS(DMA1PR,1)
// DMA1PR<DMA1PR2>
extern volatile __bit                   DMA1PR2             __at(0x5B2);	// @ (0xB6 * 8 + 2)
#define                                 DMA1PR2_bit         _BIT_ACCESS(DMA1PR,2)
// PIE2<DMA1SCNTIE>
extern volatile __bit                   DMA1SCNTIE          __at(0x2554);	// @ (0x4AA * 8 + 4)
#define                                 DMA1SCNTIE_bit      _BIT_ACCESS(PIE2,4)
// PIR2<DMA1SCNTIF>
extern volatile __bit                   DMA1SCNTIF          __at(0x25AC);	// @ (0x4B5 * 8 + 4)
#define                                 DMA1SCNTIF_bit      _BIT_ACCESS(PIR2,4)
// IPR2<DMA1SCNTIP>
extern volatile __bit                   DMA1SCNTIP          __at(0x1B4C);	// @ (0x369 * 8 + 4)
#define                                 DMA1SCNTIP_bit      _BIT_ACCESS(IPR2,4)
// PIE6<DMA2AIE>
extern volatile __bit                   DMA2AIE             __at(0x2577);	// @ (0x4AE * 8 + 7)
#define                                 DMA2AIE_bit         _BIT_ACCESS(PIE6,7)
// PIR6<DMA2AIF>
extern volatile __bit                   DMA2AIF             __at(0x25CF);	// @ (0x4B9 * 8 + 7)
#define                                 DMA2AIF_bit         _BIT_ACCESS(PIR6,7)
// IPR6<DMA2AIP>
extern volatile __bit                   DMA2AIP             __at(0x1B6F);	// @ (0x36D * 8 + 7)
#define                                 DMA2AIP_bit         _BIT_ACCESS(IPR6,7)
// PIE6<DMA2DCNTIE>
extern volatile __bit                   DMA2DCNTIE          __at(0x2575);	// @ (0x4AE * 8 + 5)
#define                                 DMA2DCNTIE_bit      _BIT_ACCESS(PIE6,5)
// PIR6<DMA2DCNTIF>
extern volatile __bit                   DMA2DCNTIF          __at(0x25CD);	// @ (0x4B9 * 8 + 5)
#define                                 DMA2DCNTIF_bit      _BIT_ACCESS(PIR6,5)
// IPR6<DMA2DCNTIP>
extern volatile __bit                   DMA2DCNTIP          __at(0x1B6D);	// @ (0x36D * 8 + 5)
#define                                 DMA2DCNTIP_bit      _BIT_ACCESS(IPR6,5)
// PMD4<DMA2MD>
extern volatile __bit                   DMA2MD              __at(0x33E);	// @ (0x67 * 8 + 6)
#define                                 DMA2MD_bit          _BIT_ACCESS(PMD4,6)
// PIE6<DMA2ORIE>
extern volatile __bit                   DMA2ORIE            __at(0x2576);	// @ (0x4AE * 8 + 6)
#define                                 DMA2ORIE_bit        _BIT_ACCESS(PIE6,6)
// PIR6<DMA2ORIF>
extern volatile __bit                   DMA2ORIF            __at(0x25CE);	// @ (0x4B9 * 8 + 6)
#define                                 DMA2ORIF_bit        _BIT_ACCESS(PIR6,6)
// IPR6<DMA2ORIP>
extern volatile __bit                   DMA2ORIP            __at(0x1B6E);	// @ (0x36D * 8 + 6)
#define                                 DMA2ORIP_bit        _BIT_ACCESS(IPR6,6)
// DMA2PR<DMA2PR0>
extern volatile __bit                   DMA2PR0             __at(0x5B8);	// @ (0xB7 * 8 + 0)
#define                                 DMA2PR0_bit         _BIT_ACCESS(DMA2PR,0)
// DMA2PR<DMA2PR1>
extern volatile __bit                   DMA2PR1             __at(0x5B9);	// @ (0xB7 * 8 + 1)
#define                                 DMA2PR1_bit         _BIT_ACCESS(DMA2PR,1)
// DMA2PR<DMA2PR2>
extern volatile __bit                   DMA2PR2             __at(0x5BA);	// @ (0xB7 * 8 + 2)
#define                                 DMA2PR2_bit         _BIT_ACCESS(DMA2PR,2)
// PIE6<DMA2SCNTIE>
extern volatile __bit                   DMA2SCNTIE          __at(0x2574);	// @ (0x4AE * 8 + 4)
#define                                 DMA2SCNTIE_bit      _BIT_ACCESS(PIE6,4)
// PIR6<DMA2SCNTIF>
extern volatile __bit                   DMA2SCNTIF          __at(0x25CC);	// @ (0x4B9 * 8 + 4)
#define                                 DMA2SCNTIF_bit      _BIT_ACCESS(PIR6,4)
// IPR6<DMA2SCNTIP>
extern volatile __bit                   DMA2SCNTIP          __at(0x1B6C);	// @ (0x36D * 8 + 4)
#define                                 DMA2SCNTIP_bit      _BIT_ACCESS(IPR6,4)
// PIE9<DMA3AIE>
extern volatile __bit                   DMA3AIE             __at(0x258F);	// @ (0x4B1 * 8 + 7)
#define                                 DMA3AIE_bit         _BIT_ACCESS(PIE9,7)
// PIR9<DMA3AIF>
extern volatile __bit                   DMA3AIF             __at(0x25E7);	// @ (0x4BC * 8 + 7)
#define                                 DMA3AIF_bit         _BIT_ACCESS(PIR9,7)
// IPR9<DMA3AIP>
extern volatile __bit                   DMA3AIP             __at(0x1B87);	// @ (0x370 * 8 + 7)
#define                                 DMA3AIP_bit         _BIT_ACCESS(IPR9,7)
// PIE9<DMA3DCNTIE>
extern volatile __bit                   DMA3DCNTIE          __at(0x258D);	// @ (0x4B1 * 8 + 5)
#define                                 DMA3DCNTIE_bit      _BIT_ACCESS(PIE9,5)
// PIR9<DMA3DCNTIF>
extern volatile __bit                   DMA3DCNTIF          __at(0x25E5);	// @ (0x4BC * 8 + 5)
#define                                 DMA3DCNTIF_bit      _BIT_ACCESS(PIR9,5)
// IPR9<DMA3DCNTIP>
extern volatile __bit                   DMA3DCNTIP          __at(0x1B85);	// @ (0x370 * 8 + 5)
#define                                 DMA3DCNTIP_bit      _BIT_ACCESS(IPR9,5)
// PMD4<DMA3MD>
extern volatile __bit                   DMA3MD              __at(0x33F);	// @ (0x67 * 8 + 7)
#define                                 DMA3MD_bit          _BIT_ACCESS(PMD4,7)
// PIE9<DMA3ORIE>
extern volatile __bit                   DMA3ORIE            __at(0x258E);	// @ (0x4B1 * 8 + 6)
#define                                 DMA3ORIE_bit        _BIT_ACCESS(PIE9,6)
// PIR9<DMA3ORIF>
extern volatile __bit                   DMA3ORIF            __at(0x25E6);	// @ (0x4BC * 8 + 6)
#define                                 DMA3ORIF_bit        _BIT_ACCESS(PIR9,6)
// IPR9<DMA3ORIP>
extern volatile __bit                   DMA3ORIP            __at(0x1B86);	// @ (0x370 * 8 + 6)
#define                                 DMA3ORIP_bit        _BIT_ACCESS(IPR9,6)
// DMA3PR<DMA3PR0>
extern volatile __bit                   DMA3PR0             __at(0x5C0);	// @ (0xB8 * 8 + 0)
#define                                 DMA3PR0_bit         _BIT_ACCESS(DMA3PR,0)
// DMA3PR<DMA3PR1>
extern volatile __bit                   DMA3PR1             __at(0x5C1);	// @ (0xB8 * 8 + 1)
#define                                 DMA3PR1_bit         _BIT_ACCESS(DMA3PR,1)
// DMA3PR<DMA3PR2>
extern volatile __bit                   DMA3PR2             __at(0x5C2);	// @ (0xB8 * 8 + 2)
#define                                 DMA3PR2_bit         _BIT_ACCESS(DMA3PR,2)
// PIE9<DMA3SCNTIE>
extern volatile __bit                   DMA3SCNTIE          __at(0x258C);	// @ (0x4B1 * 8 + 4)
#define                                 DMA3SCNTIE_bit      _BIT_ACCESS(PIE9,4)
// PIR9<DMA3SCNTIF>
extern volatile __bit                   DMA3SCNTIF          __at(0x25E4);	// @ (0x4BC * 8 + 4)
#define                                 DMA3SCNTIF_bit      _BIT_ACCESS(PIR9,4)
// IPR9<DMA3SCNTIP>
extern volatile __bit                   DMA3SCNTIP          __at(0x1B84);	// @ (0x370 * 8 + 4)
#define                                 DMA3SCNTIP_bit      _BIT_ACCESS(IPR9,4)
// PIE10<DMA4AIE>
extern volatile __bit                   DMA4AIE             __at(0x2597);	// @ (0x4B2 * 8 + 7)
#define                                 DMA4AIE_bit         _BIT_ACCESS(PIE10,7)
// PIR10<DMA4AIF>
extern volatile __bit                   DMA4AIF             __at(0x25EF);	// @ (0x4BD * 8 + 7)
#define                                 DMA4AIF_bit         _BIT_ACCESS(PIR10,7)
// IPR10<DMA4AIP>
extern volatile __bit                   DMA4AIP             __at(0x1B8F);	// @ (0x371 * 8 + 7)
#define                                 DMA4AIP_bit         _BIT_ACCESS(IPR10,7)
// PIE10<DMA4DCNTIE>
extern volatile __bit                   DMA4DCNTIE          __at(0x2595);	// @ (0x4B2 * 8 + 5)
#define                                 DMA4DCNTIE_bit      _BIT_ACCESS(PIE10,5)
// PIR10<DMA4DCNTIF>
extern volatile __bit                   DMA4DCNTIF          __at(0x25ED);	// @ (0x4BD * 8 + 5)
#define                                 DMA4DCNTIF_bit      _BIT_ACCESS(PIR10,5)
// IPR10<DMA4DCNTIP>
extern volatile __bit                   DMA4DCNTIP          __at(0x1B8D);	// @ (0x371 * 8 + 5)
#define                                 DMA4DCNTIP_bit      _BIT_ACCESS(IPR10,5)
// PMD5<DMA4MD>
extern volatile __bit                   DMA4MD              __at(0x340);	// @ (0x68 * 8 + 0)
#define                                 DMA4MD_bit          _BIT_ACCESS(PMD5,0)
// PIE10<DMA4ORIE>
extern volatile __bit                   DMA4ORIE            __at(0x2596);	// @ (0x4B2 * 8 + 6)
#define                                 DMA4ORIE_bit        _BIT_ACCESS(PIE10,6)
// PIR10<DMA4ORIF>
extern volatile __bit                   DMA4ORIF            __at(0x25EE);	// @ (0x4BD * 8 + 6)
#define                                 DMA4ORIF_bit        _BIT_ACCESS(PIR10,6)
// IPR10<DMA4ORIP>
extern volatile __bit                   DMA4ORIP            __at(0x1B8E);	// @ (0x371 * 8 + 6)
#define                                 DMA4ORIP_bit        _BIT_ACCESS(IPR10,6)
// DMA4PR<DMA4PR0>
extern volatile __bit                   DMA4PR0             __at(0x5C8);	// @ (0xB9 * 8 + 0)
#define                                 DMA4PR0_bit         _BIT_ACCESS(DMA4PR,0)
// DMA4PR<DMA4PR1>
extern volatile __bit                   DMA4PR1             __at(0x5C9);	// @ (0xB9 * 8 + 1)
#define                                 DMA4PR1_bit         _BIT_ACCESS(DMA4PR,1)
// DMA4PR<DMA4PR2>
extern volatile __bit                   DMA4PR2             __at(0x5CA);	// @ (0xB9 * 8 + 2)
#define                                 DMA4PR2_bit         _BIT_ACCESS(DMA4PR,2)
// PIE10<DMA4SCNTIE>
extern volatile __bit                   DMA4SCNTIE          __at(0x2594);	// @ (0x4B2 * 8 + 4)
#define                                 DMA4SCNTIE_bit      _BIT_ACCESS(PIE10,4)
// PIR10<DMA4SCNTIF>
extern volatile __bit                   DMA4SCNTIF          __at(0x25EC);	// @ (0x4BD * 8 + 4)
#define                                 DMA4SCNTIF_bit      _BIT_ACCESS(PIR10,4)
// IPR10<DMA4SCNTIP>
extern volatile __bit                   DMA4SCNTIP          __at(0x1B8C);	// @ (0x371 * 8 + 4)
#define                                 DMA4SCNTIP_bit      _BIT_ACCESS(IPR10,4)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x2794);	// @ (0x4F2 * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x1F98);	// @ (0x3F3 * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x2790);	// @ (0x4F2 * 8 + 0)
#define                                 DOZE0_bit           _BIT_ACCESS(CPUDOZE,0)
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x2791);	// @ (0x4F2 * 8 + 1)
#define                                 DOZE1_bit           _BIT_ACCESS(CPUDOZE,1)
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x2792);	// @ (0x4F2 * 8 + 2)
#define                                 DOZE2_bit           _BIT_ACCESS(CPUDOZE,2)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x2796);	// @ (0x4F2 * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// DMAnDPTRL<DPTR0>
extern volatile __bit                   DPTR0               __at(0x760);	// @ (0xEC * 8 + 0)
#define                                 DPTR0_bit           _BIT_ACCESS(DMAnDPTRL,0)
// DMAnDPTRL<DPTR1>
extern volatile __bit                   DPTR1               __at(0x761);	// @ (0xEC * 8 + 1)
#define                                 DPTR1_bit           _BIT_ACCESS(DMAnDPTRL,1)
// DMAnDPTRH<DPTR10>
extern volatile __bit                   DPTR10              __at(0x76A);	// @ (0xED * 8 + 2)
#define                                 DPTR10_bit          _BIT_ACCESS(DMAnDPTRH,2)
// DMAnDPTRH<DPTR11>
extern volatile __bit                   DPTR11              __at(0x76B);	// @ (0xED * 8 + 3)
#define                                 DPTR11_bit          _BIT_ACCESS(DMAnDPTRH,3)
// DMAnDPTRH<DPTR12>
extern volatile __bit                   DPTR12              __at(0x76C);	// @ (0xED * 8 + 4)
#define                                 DPTR12_bit          _BIT_ACCESS(DMAnDPTRH,4)
// DMAnDPTRH<DPTR13>
extern volatile __bit                   DPTR13              __at(0x76D);	// @ (0xED * 8 + 5)
#define                                 DPTR13_bit          _BIT_ACCESS(DMAnDPTRH,5)
// DMAnDPTRH<DPTR14>
extern volatile __bit                   DPTR14              __at(0x76E);	// @ (0xED * 8 + 6)
#define                                 DPTR14_bit          _BIT_ACCESS(DMAnDPTRH,6)
// DMAnDPTRH<DPTR15>
extern volatile __bit                   DPTR15              __at(0x76F);	// @ (0xED * 8 + 7)
#define                                 DPTR15_bit          _BIT_ACCESS(DMAnDPTRH,7)
// DMAnDPTRL<DPTR2>
extern volatile __bit                   DPTR2               __at(0x762);	// @ (0xEC * 8 + 2)
#define                                 DPTR2_bit           _BIT_ACCESS(DMAnDPTRL,2)
// DMAnDPTRL<DPTR3>
extern volatile __bit                   DPTR3               __at(0x763);	// @ (0xEC * 8 + 3)
#define                                 DPTR3_bit           _BIT_ACCESS(DMAnDPTRL,3)
// DMAnDPTRL<DPTR4>
extern volatile __bit                   DPTR4               __at(0x764);	// @ (0xEC * 8 + 4)
#define                                 DPTR4_bit           _BIT_ACCESS(DMAnDPTRL,4)
// DMAnDPTRL<DPTR5>
extern volatile __bit                   DPTR5               __at(0x765);	// @ (0xEC * 8 + 5)
#define                                 DPTR5_bit           _BIT_ACCESS(DMAnDPTRL,5)
// DMAnDPTRL<DPTR6>
extern volatile __bit                   DPTR6               __at(0x766);	// @ (0xEC * 8 + 6)
#define                                 DPTR6_bit           _BIT_ACCESS(DMAnDPTRL,6)
// DMAnDPTRL<DPTR7>
extern volatile __bit                   DPTR7               __at(0x767);	// @ (0xEC * 8 + 7)
#define                                 DPTR7_bit           _BIT_ACCESS(DMAnDPTRL,7)
// DMAnDPTRH<DPTR8>
extern volatile __bit                   DPTR8               __at(0x768);	// @ (0xED * 8 + 0)
#define                                 DPTR8_bit           _BIT_ACCESS(DMAnDPTRH,0)
// DMAnDPTRH<DPTR9>
extern volatile __bit                   DPTR9               __at(0x769);	// @ (0xED * 8 + 1)
#define                                 DPTR9_bit           _BIT_ACCESS(DMAnDPTRH,1)
// DMAnDSAL<DSA0>
extern volatile __bit                   DSA0                __at(0x780);	// @ (0xF0 * 8 + 0)
#define                                 DSA0_bit            _BIT_ACCESS(DMAnDSAL,0)
// DMAnDSAL<DSA1>
extern volatile __bit                   DSA1                __at(0x781);	// @ (0xF0 * 8 + 1)
#define                                 DSA1_bit            _BIT_ACCESS(DMAnDSAL,1)
// DMAnDSAH<DSA10>
extern volatile __bit                   DSA10               __at(0x78A);	// @ (0xF1 * 8 + 2)
#define                                 DSA10_bit           _BIT_ACCESS(DMAnDSAH,2)
// DMAnDSAH<DSA11>
extern volatile __bit                   DSA11               __at(0x78B);	// @ (0xF1 * 8 + 3)
#define                                 DSA11_bit           _BIT_ACCESS(DMAnDSAH,3)
// DMAnDSAH<DSA12>
extern volatile __bit                   DSA12               __at(0x78C);	// @ (0xF1 * 8 + 4)
#define                                 DSA12_bit           _BIT_ACCESS(DMAnDSAH,4)
// DMAnDSAH<DSA13>
extern volatile __bit                   DSA13               __at(0x78D);	// @ (0xF1 * 8 + 5)
#define                                 DSA13_bit           _BIT_ACCESS(DMAnDSAH,5)
// DMAnDSAH<DSA14>
extern volatile __bit                   DSA14               __at(0x78E);	// @ (0xF1 * 8 + 6)
#define                                 DSA14_bit           _BIT_ACCESS(DMAnDSAH,6)
// DMAnDSAH<DSA15>
extern volatile __bit                   DSA15               __at(0x78F);	// @ (0xF1 * 8 + 7)
#define                                 DSA15_bit           _BIT_ACCESS(DMAnDSAH,7)
// DMAnDSAL<DSA2>
extern volatile __bit                   DSA2                __at(0x782);	// @ (0xF0 * 8 + 2)
#define                                 DSA2_bit            _BIT_ACCESS(DMAnDSAL,2)
// DMAnDSAL<DSA3>
extern volatile __bit                   DSA3                __at(0x783);	// @ (0xF0 * 8 + 3)
#define                                 DSA3_bit            _BIT_ACCESS(DMAnDSAL,3)
// DMAnDSAL<DSA4>
extern volatile __bit                   DSA4                __at(0x784);	// @ (0xF0 * 8 + 4)
#define                                 DSA4_bit            _BIT_ACCESS(DMAnDSAL,4)
// DMAnDSAL<DSA5>
extern volatile __bit                   DSA5                __at(0x785);	// @ (0xF0 * 8 + 5)
#define                                 DSA5_bit            _BIT_ACCESS(DMAnDSAL,5)
// DMAnDSAL<DSA6>
extern volatile __bit                   DSA6                __at(0x786);	// @ (0xF0 * 8 + 6)
#define                                 DSA6_bit            _BIT_ACCESS(DMAnDSAL,6)
// DMAnDSAL<DSA7>
extern volatile __bit                   DSA7                __at(0x787);	// @ (0xF0 * 8 + 7)
#define                                 DSA7_bit            _BIT_ACCESS(DMAnDSAL,7)
// DMAnDSAH<DSA8>
extern volatile __bit                   DSA8                __at(0x788);	// @ (0xF1 * 8 + 0)
#define                                 DSA8_bit            _BIT_ACCESS(DMAnDSAH,0)
// DMAnDSAH<DSA9>
extern volatile __bit                   DSA9                __at(0x789);	// @ (0xF1 * 8 + 1)
#define                                 DSA9_bit            _BIT_ACCESS(DMAnDSAH,1)
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0x1FA0);	// @ (0x3F4 * 8 + 0)
#define                                 DSEN_bit            _BIT_ACCESS(ADCON1,0)
// PMD2<DSM1MD>
extern volatile __bit                   DSM1MD              __at(0x32D);	// @ (0x65 * 8 + 5)
#define                                 DSM1MD_bit          _BIT_ACCESS(PMD2,5)
// DMAnCON1<DSTP>
extern volatile __bit                   DSTP                __at(0x7ED);	// @ (0xFD * 8 + 5)
#define                                 DSTP_bit            _BIT_ACCESS(DMAnCON1,5)
// DMAnDSZL<DSZ0>
extern volatile __bit                   DSZ0                __at(0x770);	// @ (0xEE * 8 + 0)
#define                                 DSZ0_bit            _BIT_ACCESS(DMAnDSZL,0)
// DMAnDSZL<DSZ1>
extern volatile __bit                   DSZ1                __at(0x771);	// @ (0xEE * 8 + 1)
#define                                 DSZ1_bit            _BIT_ACCESS(DMAnDSZL,1)
// DMAnDSZH<DSZ10>
extern volatile __bit                   DSZ10               __at(0x77A);	// @ (0xEF * 8 + 2)
#define                                 DSZ10_bit           _BIT_ACCESS(DMAnDSZH,2)
// DMAnDSZH<DSZ11>
extern volatile __bit                   DSZ11               __at(0x77B);	// @ (0xEF * 8 + 3)
#define                                 DSZ11_bit           _BIT_ACCESS(DMAnDSZH,3)
// DMAnDSZL<DSZ2>
extern volatile __bit                   DSZ2                __at(0x772);	// @ (0xEE * 8 + 2)
#define                                 DSZ2_bit            _BIT_ACCESS(DMAnDSZL,2)
// DMAnDSZL<DSZ3>
extern volatile __bit                   DSZ3                __at(0x773);	// @ (0xEE * 8 + 3)
#define                                 DSZ3_bit            _BIT_ACCESS(DMAnDSZL,3)
// DMAnDSZL<DSZ4>
extern volatile __bit                   DSZ4                __at(0x774);	// @ (0xEE * 8 + 4)
#define                                 DSZ4_bit            _BIT_ACCESS(DMAnDSZL,4)
// DMAnDSZL<DSZ5>
