GopalSaraf/Practicals/PSDL/include/proc/pic18f06q41.h
#define                                 INT2PPS3_bit        _BIT_ACCESS(INT2PPS,3)
// INT2PPS<INT2PPS4>
extern volatile __bit                   INT2PPS4            __at(0x1204);	// @ (0x240 * 8 + 4)
#define                                 INT2PPS4_bit        _BIT_ACCESS(INT2PPS,4)
// INT2PPS<INT2PPS5>
extern volatile __bit                   INT2PPS5            __at(0x1205);	// @ (0x240 * 8 + 5)
#define                                 INT2PPS5_bit        _BIT_ACCESS(INT2PPS,5)
// HLVDCON0<INTH>
extern volatile __bit                   INTH                __at(0x251);	// @ (0x4A * 8 + 1)
#define                                 INTH_bit            _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<INTL>
extern volatile __bit                   INTL                __at(0x250);	// @ (0x4A * 8 + 0)
#define                                 INTL_bit            _BIT_ACCESS(HLVDCON0,0)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x2038);	// @ (0x407 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x2039);	// @ (0x407 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x203A);	// @ (0x407 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x203B);	// @ (0x407 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x203C);	// @ (0x407 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x203D);	// @ (0x407 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x2030);	// @ (0x406 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x2031);	// @ (0x406 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x2032);	// @ (0x406 * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x2033);	// @ (0x406 * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x2034);	// @ (0x406 * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x2035);	// @ (0x406 * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x2028);	// @ (0x405 * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x2029);	// @ (0x405 * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x202A);	// @ (0x405 * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x202B);	// @ (0x405 * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x202C);	// @ (0x405 * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x202D);	// @ (0x405 * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0x20B8);	// @ (0x417 * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0x20B9);	// @ (0x417 * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0x20BA);	// @ (0x417 * 8 + 2)
#define                                 IOCCF2_bit          _BIT_ACCESS(IOCCF,2)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0x20BB);	// @ (0x417 * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0x20BC);	// @ (0x417 * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0x20BD);	// @ (0x417 * 8 + 5)
#define                                 IOCCF5_bit          _BIT_ACCESS(IOCCF,5)
// IOCCN<IOCCN0>
extern volatile __bit                   IOCCN0              __at(0x20B0);	// @ (0x416 * 8 + 0)
#define                                 IOCCN0_bit          _BIT_ACCESS(IOCCN,0)
// IOCCN<IOCCN1>
extern volatile __bit                   IOCCN1              __at(0x20B1);	// @ (0x416 * 8 + 1)
#define                                 IOCCN1_bit          _BIT_ACCESS(IOCCN,1)
// IOCCN<IOCCN2>
extern volatile __bit                   IOCCN2              __at(0x20B2);	// @ (0x416 * 8 + 2)
#define                                 IOCCN2_bit          _BIT_ACCESS(IOCCN,2)
// IOCCN<IOCCN3>
extern volatile __bit                   IOCCN3              __at(0x20B3);	// @ (0x416 * 8 + 3)
#define                                 IOCCN3_bit          _BIT_ACCESS(IOCCN,3)
// IOCCN<IOCCN4>
extern volatile __bit                   IOCCN4              __at(0x20B4);	// @ (0x416 * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0x20B5);	// @ (0x416 * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCP<IOCCP0>
extern volatile __bit                   IOCCP0              __at(0x20A8);	// @ (0x415 * 8 + 0)
#define                                 IOCCP0_bit          _BIT_ACCESS(IOCCP,0)
// IOCCP<IOCCP1>
extern volatile __bit                   IOCCP1              __at(0x20A9);	// @ (0x415 * 8 + 1)
#define                                 IOCCP1_bit          _BIT_ACCESS(IOCCP,1)
// IOCCP<IOCCP2>
extern volatile __bit                   IOCCP2              __at(0x20AA);	// @ (0x415 * 8 + 2)
#define                                 IOCCP2_bit          _BIT_ACCESS(IOCCP,2)
// IOCCP<IOCCP3>
extern volatile __bit                   IOCCP3              __at(0x20AB);	// @ (0x415 * 8 + 3)
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0x20AC);	// @ (0x415 * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x20AD);	// @ (0x415 * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// PIE0<IOCIE>
extern volatile __bit                   IOCIE               __at(0x2547);	// @ (0x4A8 * 8 + 7)
#define                                 IOCIE_bit           _BIT_ACCESS(PIE0,7)
// PIR0<IOCIF>
extern volatile __bit                   IOCIF               __at(0x259F);	// @ (0x4B3 * 8 + 7)
#define                                 IOCIF_bit           _BIT_ACCESS(PIR0,7)
// IPR0<IOCIP>
extern volatile __bit                   IOCIP               __at(0x1B3F);	// @ (0x367 * 8 + 7)
#define                                 IOCIP_bit           _BIT_ACCESS(IPR0,7)
// PMD0<IOCMD>
extern volatile __bit                   IOCMD               __at(0x318);	// @ (0x63 * 8 + 0)
#define                                 IOCMD_bit           _BIT_ACCESS(PMD0,0)
// CWG1ISM<ISM0>
extern volatile __bit                   ISM0                __at(0x1DE8);	// @ (0x3BD * 8 + 0)
#define                                 ISM0_bit            _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<ISM1>
extern volatile __bit                   ISM1                __at(0x1DE9);	// @ (0x3BD * 8 + 1)
#define                                 ISM1_bit            _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<ISM2>
extern volatile __bit                   ISM2                __at(0x1DEA);	// @ (0x3BD * 8 + 2)
#define                                 ISM2_bit            _BIT_ACCESS(CWG1ISM,2)
// CWG1ISM<ISM3>
extern volatile __bit                   ISM3                __at(0x1DEB);	// @ (0x3BD * 8 + 3)
#define                                 ISM3_bit            _BIT_ACCESS(CWG1ISM,3)
// ISRPR<ISRPR0>
extern volatile __bit                   ISRPR0              __at(0x5F8);	// @ (0xBF * 8 + 0)
#define                                 ISRPR0_bit          _BIT_ACCESS(ISRPR,0)
// ISRPR<ISRPR1>
extern volatile __bit                   ISRPR1              __at(0x5F9);	// @ (0xBF * 8 + 1)
#define                                 ISRPR1_bit          _BIT_ACCESS(ISRPR,1)
// ISRPR<ISRPR2>
extern volatile __bit                   ISRPR2              __at(0x5FA);	// @ (0xBF * 8 + 2)
#define                                 ISRPR2_bit          _BIT_ACCESS(ISRPR,2)
// IVTLOCK<IVTLOCKED>
extern volatile __bit                   IVTLOCKED           __at(0x22C8);	// @ (0x459 * 8 + 0)
#define                                 IVTLOCKED_bit       _BIT_ACCESS(IVTLOCK,0)
// SCANLADRL<LADR0>
extern volatile __bit                   LADR0               __at(0x1AD0);	// @ (0x35A * 8 + 0)
#define                                 LADR0_bit           _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<LADR1>
extern volatile __bit                   LADR1               __at(0x1AD1);	// @ (0x35A * 8 + 1)
#define                                 LADR1_bit           _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<LADR10>
extern volatile __bit                   LADR10              __at(0x1ADA);	// @ (0x35B * 8 + 2)
#define                                 LADR10_bit          _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<LADR11>
extern volatile __bit                   LADR11              __at(0x1ADB);	// @ (0x35B * 8 + 3)
#define                                 LADR11_bit          _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<LADR12>
extern volatile __bit                   LADR12              __at(0x1ADC);	// @ (0x35B * 8 + 4)
#define                                 LADR12_bit          _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<LADR13>
extern volatile __bit                   LADR13              __at(0x1ADD);	// @ (0x35B * 8 + 5)
#define                                 LADR13_bit          _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<LADR14>
extern volatile __bit                   LADR14              __at(0x1ADE);	// @ (0x35B * 8 + 6)
#define                                 LADR14_bit          _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<LADR15>
extern volatile __bit                   LADR15              __at(0x1ADF);	// @ (0x35B * 8 + 7)
#define                                 LADR15_bit          _BIT_ACCESS(SCANLADRH,7)
// SCANLADRU<LADR16>
extern volatile __bit                   LADR16              __at(0x1AE0);	// @ (0x35C * 8 + 0)
#define                                 LADR16_bit          _BIT_ACCESS(SCANLADRU,0)
// SCANLADRU<LADR17>
extern volatile __bit                   LADR17              __at(0x1AE1);	// @ (0x35C * 8 + 1)
#define                                 LADR17_bit          _BIT_ACCESS(SCANLADRU,1)
// SCANLADRU<LADR18>
extern volatile __bit                   LADR18              __at(0x1AE2);	// @ (0x35C * 8 + 2)
#define                                 LADR18_bit          _BIT_ACCESS(SCANLADRU,2)
// SCANLADRU<LADR19>
extern volatile __bit                   LADR19              __at(0x1AE3);	// @ (0x35C * 8 + 3)
#define                                 LADR19_bit          _BIT_ACCESS(SCANLADRU,3)
// SCANLADRL<LADR2>
extern volatile __bit                   LADR2               __at(0x1AD2);	// @ (0x35A * 8 + 2)
#define                                 LADR2_bit           _BIT_ACCESS(SCANLADRL,2)
// SCANLADRU<LADR20>
extern volatile __bit                   LADR20              __at(0x1AE4);	// @ (0x35C * 8 + 4)
#define                                 LADR20_bit          _BIT_ACCESS(SCANLADRU,4)
// SCANLADRU<LADR21>
extern volatile __bit                   LADR21              __at(0x1AE5);	// @ (0x35C * 8 + 5)
#define                                 LADR21_bit          _BIT_ACCESS(SCANLADRU,5)
// SCANLADRL<LADR3>
extern volatile __bit                   LADR3               __at(0x1AD3);	// @ (0x35A * 8 + 3)
#define                                 LADR3_bit           _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<LADR4>
extern volatile __bit                   LADR4               __at(0x1AD4);	// @ (0x35A * 8 + 4)
#define                                 LADR4_bit           _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<LADR5>
extern volatile __bit                   LADR5               __at(0x1AD5);	// @ (0x35A * 8 + 5)
#define                                 LADR5_bit           _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<LADR6>
extern volatile __bit                   LADR6               __at(0x1AD6);	// @ (0x35A * 8 + 6)
#define                                 LADR6_bit           _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<LADR7>
extern volatile __bit                   LADR7               __at(0x1AD7);	// @ (0x35A * 8 + 7)
#define                                 LADR7_bit           _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<LADR8>
extern volatile __bit                   LADR8               __at(0x1AD8);	// @ (0x35B * 8 + 0)
#define                                 LADR8_bit           _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<LADR9>
extern volatile __bit                   LADR9               __at(0x1AD9);	// @ (0x35B * 8 + 1)
#define                                 LADR9_bit           _BIT_ACCESS(SCANLADRH,1)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x25F0);	// @ (0x4BE * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x25F1);	// @ (0x4BE * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x25F2);	// @ (0x4BE * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x25F4);	// @ (0x4BE * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x25F5);	// @ (0x4BE * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x2600);	// @ (0x4C0 * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x2601);	// @ (0x4C0 * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x2602);	// @ (0x4C0 * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x2603);	// @ (0x4C0 * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x2604);	// @ (0x4C0 * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x2605);	// @ (0x4C0 * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// CRCCON0<LENDIAN>
extern volatile __bit                   LENDIAN             __at(0x1AB1);	// @ (0x356 * 8 + 1)
#define                                 LENDIAN_bit         _BIT_ACCESS(CRCCON0,1)
// OSCEN<LFOEN>
extern volatile __bit                   LFOEN               __at(0x59C);	// @ (0xB3 * 8 + 4)
#define                                 LFOEN_bit           _BIT_ACCESS(OSCEN,4)
// OSCSTAT<LFOR>
extern volatile __bit                   LFOR                __at(0x594);	// @ (0xB2 * 8 + 4)
#define                                 LFOR_bit            _BIT_ACCESS(OSCSTAT,4)
// ACTCON<LOCK>
extern volatile __bit                   LOCK                __at(0x563);	// @ (0xAC * 8 + 3)
#define                                 LOCK_bit            _BIT_ACCESS(ACTCON,3)
// CWG1AS0<LSAC0>
extern volatile __bit                   LSAC0               __at(0x1E12);	// @ (0x3C2 * 8 + 2)
#define                                 LSAC0_bit           _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<LSAC1>
extern volatile __bit                   LSAC1               __at(0x1E13);	// @ (0x3C2 * 8 + 3)
#define                                 LSAC1_bit           _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<LSBD0>
extern volatile __bit                   LSBD0               __at(0x1E14);	// @ (0x3C2 * 8 + 4)
#define                                 LSBD0_bit           _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<LSBD1>
extern volatile __bit                   LSBD1               __at(0x1E15);	// @ (0x3C2 * 8 + 5)
#define                                 LSBD1_bit           _BIT_ACCESS(CWG1AS0,5)
// CWG1AS0<LSCA1>
extern volatile __bit                   LSCA1               __at(0x1E13);	// @ (0x3C2 * 8 + 3)
#define                                 LSCA1_bit           _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<LSDB0>
extern volatile __bit                   LSDB0               __at(0x1E14);	// @ (0x3C2 * 8 + 4)
#define                                 LSDB0_bit           _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<LSDB1>
extern volatile __bit                   LSDB1               __at(0x1E15);	// @ (0x3C2 * 8 + 5)
#define                                 LSDB1_bit           _BIT_ACCESS(CWG1AS0,5)
// ADLTHL<LTH0>
extern volatile __bit                   LTH0                __at(0x1EC8);	// @ (0x3D9 * 8 + 0)
#define                                 LTH0_bit            _BIT_ACCESS(ADLTHL,0)
// ADLTHL<LTH1>
extern volatile __bit                   LTH1                __at(0x1EC9);	// @ (0x3D9 * 8 + 1)
#define                                 LTH1_bit            _BIT_ACCESS(ADLTHL,1)
// ADLTHH<LTH10>
extern volatile __bit                   LTH10               __at(0x1ED2);	// @ (0x3DA * 8 + 2)
#define                                 LTH10_bit           _BIT_ACCESS(ADLTHH,2)
// ADLTHH<LTH11>
extern volatile __bit                   LTH11               __at(0x1ED3);	// @ (0x3DA * 8 + 3)
#define                                 LTH11_bit           _BIT_ACCESS(ADLTHH,3)
// ADLTHH<LTH12>
extern volatile __bit                   LTH12               __at(0x1ED4);	// @ (0x3DA * 8 + 4)
#define                                 LTH12_bit           _BIT_ACCESS(ADLTHH,4)
// ADLTHH<LTH13>
extern volatile __bit                   LTH13               __at(0x1ED5);	// @ (0x3DA * 8 + 5)
#define                                 LTH13_bit           _BIT_ACCESS(ADLTHH,5)
// ADLTHH<LTH14>
extern volatile __bit                   LTH14               __at(0x1ED6);	// @ (0x3DA * 8 + 6)
#define                                 LTH14_bit           _BIT_ACCESS(ADLTHH,6)
// ADLTHH<LTH15>
extern volatile __bit                   LTH15               __at(0x1ED7);	// @ (0x3DA * 8 + 7)
#define                                 LTH15_bit           _BIT_ACCESS(ADLTHH,7)
// ADLTHL<LTH2>
extern volatile __bit                   LTH2                __at(0x1ECA);	// @ (0x3D9 * 8 + 2)
#define                                 LTH2_bit            _BIT_ACCESS(ADLTHL,2)
// ADLTHL<LTH3>
extern volatile __bit                   LTH3                __at(0x1ECB);	// @ (0x3D9 * 8 + 3)
#define                                 LTH3_bit            _BIT_ACCESS(ADLTHL,3)
// ADLTHL<LTH4>
extern volatile __bit                   LTH4                __at(0x1ECC);	// @ (0x3D9 * 8 + 4)
#define                                 LTH4_bit            _BIT_ACCESS(ADLTHL,4)
// ADLTHL<LTH5>
extern volatile __bit                   LTH5                __at(0x1ECD);	// @ (0x3D9 * 8 + 5)
#define                                 LTH5_bit            _BIT_ACCESS(ADLTHL,5)
// ADLTHL<LTH6>
extern volatile __bit                   LTH6                __at(0x1ECE);	// @ (0x3D9 * 8 + 6)
#define                                 LTH6_bit            _BIT_ACCESS(ADLTHL,6)
// ADLTHL<LTH7>
extern volatile __bit                   LTH7                __at(0x1ECF);	// @ (0x3D9 * 8 + 7)
#define                                 LTH7_bit            _BIT_ACCESS(ADLTHL,7)
// ADLTHH<LTH8>
extern volatile __bit                   LTH8                __at(0x1ED0);	// @ (0x3DA * 8 + 0)
#define                                 LTH8_bit            _BIT_ACCESS(ADLTHH,0)
// ADLTHH<LTH9>
extern volatile __bit                   LTH9                __at(0x1ED1);	// @ (0x3DA * 8 + 1)
#define                                 LTH9_bit            _BIT_ACCESS(ADLTHH,1)
// ADSTAT<LTHR>
extern volatile __bit                   LTHR                __at(0x1FBD);	// @ (0x3F7 * 8 + 5)
#define                                 LTHR_bit            _BIT_ACCESS(ADSTAT,5)
// PMD0<LVDMD>
extern volatile __bit                   LVDMD               __at(0x31D);	// @ (0x63 * 8 + 5)
#define                                 LVDMD_bit           _BIT_ACCESS(PMD0,5)
// MAINPR<MAINPR0>
extern volatile __bit                   MAINPR0             __at(0x5F0);	// @ (0xBE * 8 + 0)
#define                                 MAINPR0_bit         _BIT_ACCESS(MAINPR,0)
// MAINPR<MAINPR1>
extern volatile __bit                   MAINPR1             __at(0x5F1);	// @ (0xBE * 8 + 1)
#define                                 MAINPR1_bit         _BIT_ACCESS(MAINPR,1)
// MAINPR<MAINPR2>
extern volatile __bit                   MAINPR2             __at(0x5F2);	// @ (0xBE * 8 + 2)
#define                                 MAINPR2_bit         _BIT_ACCESS(MAINPR,2)
// ADSTAT<MATH>
extern volatile __bit                   MATH                __at(0x1FBC);	// @ (0x3F7 * 8 + 4)
#define                                 MATH_bit            _BIT_ACCESS(ADSTAT,4)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x378);	// @ (0x6F * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x379);	// @ (0x6F * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// ADCON2<MD0>
extern volatile __bit                   MD0                 __at(0x1FA8);	// @ (0x3F5 * 8 + 0)
#define                                 MD0_bit             _BIT_ACCESS(ADCON2,0)
// ADCON2<MD1>
extern volatile __bit                   MD1                 __at(0x1FA9);	// @ (0x3F5 * 8 + 1)
#define                                 MD1_bit             _BIT_ACCESS(ADCON2,1)
// T0CON0<MD16>
extern volatile __bit                   MD16                __at(0x18D4);	// @ (0x31A * 8 + 4)
#define                                 MD16_bit            _BIT_ACCESS(T0CON0,4)
