GopalSaraf/Practicals/PSDL/include/proc/pic18f06q41.h
extern volatile __bit                   OPA1ORS2            __at(0x54A);	// @ (0xA9 * 8 + 2)
#define                                 OPA1ORS2_bit        _BIT_ACCESS(OPA1ORS,2)
// OPA1ORS<OPA1ORS3>
extern volatile __bit                   OPA1ORS3            __at(0x54B);	// @ (0xA9 * 8 + 3)
#define                                 OPA1ORS3_bit        _BIT_ACCESS(OPA1ORS,3)
// OPA1ORS<OPA1ORS4>
extern volatile __bit                   OPA1ORS4            __at(0x54C);	// @ (0xA9 * 8 + 4)
#define                                 OPA1ORS4_bit        _BIT_ACCESS(OPA1ORS,4)
// OPA1CON2<OPA1PCH0>
extern volatile __bit                   OPA1PCH0            __at(0x528);	// @ (0xA5 * 8 + 0)
#define                                 OPA1PCH0_bit        _BIT_ACCESS(OPA1CON2,0)
// OPA1CON2<OPA1PCH1>
extern volatile __bit                   OPA1PCH1            __at(0x529);	// @ (0xA5 * 8 + 1)
#define                                 OPA1PCH1_bit        _BIT_ACCESS(OPA1CON2,1)
// OPA1CON2<OPA1PCH2>
extern volatile __bit                   OPA1PCH2            __at(0x52A);	// @ (0xA5 * 8 + 2)
#define                                 OPA1PCH2_bit        _BIT_ACCESS(OPA1CON2,2)
// OPA1CON3<OPA1PSS0>
extern volatile __bit                   OPA1PSS0            __at(0x530);	// @ (0xA6 * 8 + 0)
#define                                 OPA1PSS0_bit        _BIT_ACCESS(OPA1CON3,0)
// OPA1CON3<OPA1PSS1>
extern volatile __bit                   OPA1PSS1            __at(0x531);	// @ (0xA6 * 8 + 1)
#define                                 OPA1PSS1_bit        _BIT_ACCESS(OPA1CON3,1)
// OPA1CON1<OPA1RESON>
extern volatile __bit                   OPA1RESON           __at(0x523);	// @ (0xA4 * 8 + 3)
#define                                 OPA1RESON_bit       _BIT_ACCESS(OPA1CON1,3)
// OPA1CON0<OPA1SOC0>
extern volatile __bit                   OPA1SOC0            __at(0x518);	// @ (0xA3 * 8 + 0)
#define                                 OPA1SOC0_bit        _BIT_ACCESS(OPA1CON0,0)
// OPA1CON0<OPA1SOC1>
extern volatile __bit                   OPA1SOC1            __at(0x519);	// @ (0xA3 * 8 + 1)
#define                                 OPA1SOC1_bit        _BIT_ACCESS(OPA1CON0,1)
// OPA1CON0<OPA1SOC2>
extern volatile __bit                   OPA1SOC2            __at(0x51A);	// @ (0xA3 * 8 + 2)
#define                                 OPA1SOC2_bit        _BIT_ACCESS(OPA1CON0,2)
// OPA1CON0<OPA1UG>
extern volatile __bit                   OPA1UG              __at(0x51B);	// @ (0xA3 * 8 + 3)
#define                                 OPA1UG_bit          _BIT_ACCESS(OPA1CON0,3)
// PMD5<OPAMD>
extern volatile __bit                   OPAMD               __at(0x342);	// @ (0x68 * 8 + 2)
#define                                 OPAMD_bit           _BIT_ACCESS(PMD5,2)
// MD1CON0<OPOL>
extern volatile __bit                   OPOL                __at(0x354);	// @ (0x6A * 8 + 4)
#define                                 OPOL_bit            _BIT_ACCESS(MD1CON0,4)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x57C);	// @ (0xAF * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// OPA1HWC<OREN>
extern volatile __bit                   OREN                __at(0x53F);	// @ (0xA7 * 8 + 7)
#define                                 OREN_bit            _BIT_ACCESS(OPA1HWC,7)
// OPA1HWC<ORPOL>
extern volatile __bit                   ORPOL               __at(0x53B);	// @ (0xA7 * 8 + 3)
#define                                 ORPOL_bit           _BIT_ACCESS(OPA1HWC,3)
// ACTCON<ORS>
extern volatile __bit                   ORS                 __at(0x561);	// @ (0xAC * 8 + 1)
#define                                 ORS_bit             _BIT_ACCESS(ACTCON,1)
// OPA1ORS<ORS0>
extern volatile __bit                   ORS0                __at(0x548);	// @ (0xA9 * 8 + 0)
#define                                 ORS0_bit            _BIT_ACCESS(OPA1ORS,0)
// OPA1ORS<ORS1>
extern volatile __bit                   ORS1                __at(0x549);	// @ (0xA9 * 8 + 1)
#define                                 ORS1_bit            _BIT_ACCESS(OPA1ORS,1)
// OPA1ORS<ORS2>
extern volatile __bit                   ORS2                __at(0x54A);	// @ (0xA9 * 8 + 2)
#define                                 ORS2_bit            _BIT_ACCESS(OPA1ORS,2)
// OPA1ORS<ORS3>
extern volatile __bit                   ORS3                __at(0x54B);	// @ (0xA9 * 8 + 3)
#define                                 ORS3_bit            _BIT_ACCESS(OPA1ORS,3)
// OPA1ORS<ORS4>
extern volatile __bit                   ORS4                __at(0x54C);	// @ (0xA9 * 8 + 4)
#define                                 ORS4_bit            _BIT_ACCESS(OPA1ORS,4)
// PIE0<OSFIE>
extern volatile __bit                   OSFIE               __at(0x2542);	// @ (0x4A8 * 8 + 2)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE0,2)
// PIR0<OSFIF>
extern volatile __bit                   OSFIF               __at(0x259A);	// @ (0x4B3 * 8 + 2)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR0,2)
// IPR0<OSFIP>
extern volatile __bit                   OSFIP               __at(0x1B3A);	// @ (0x367 * 8 + 2)
#define                                 OSFIP_bit           _BIT_ACCESS(IPR0,2)
// CRCOUTL<OUT0>
extern volatile __bit                   OUT0                __at(0x1A90);	// @ (0x352 * 8 + 0)
#define                                 OUT0_bit            _BIT_ACCESS(CRCOUTL,0)
// CRCOUTL<OUT1>
extern volatile __bit                   OUT1                __at(0x1A91);	// @ (0x352 * 8 + 1)
#define                                 OUT1_bit            _BIT_ACCESS(CRCOUTL,1)
// CRCOUTH<OUT10>
extern volatile __bit                   OUT10               __at(0x1A9A);	// @ (0x353 * 8 + 2)
#define                                 OUT10_bit           _BIT_ACCESS(CRCOUTH,2)
// CRCOUTH<OUT11>
extern volatile __bit                   OUT11               __at(0x1A9B);	// @ (0x353 * 8 + 3)
#define                                 OUT11_bit           _BIT_ACCESS(CRCOUTH,3)
// CRCOUTH<OUT12>
extern volatile __bit                   OUT12               __at(0x1A9C);	// @ (0x353 * 8 + 4)
#define                                 OUT12_bit           _BIT_ACCESS(CRCOUTH,4)
// CRCOUTH<OUT13>
extern volatile __bit                   OUT13               __at(0x1A9D);	// @ (0x353 * 8 + 5)
#define                                 OUT13_bit           _BIT_ACCESS(CRCOUTH,5)
// CRCOUTH<OUT14>
extern volatile __bit                   OUT14               __at(0x1A9E);	// @ (0x353 * 8 + 6)
#define                                 OUT14_bit           _BIT_ACCESS(CRCOUTH,6)
// CRCOUTH<OUT15>
extern volatile __bit                   OUT15               __at(0x1A9F);	// @ (0x353 * 8 + 7)
#define                                 OUT15_bit           _BIT_ACCESS(CRCOUTH,7)
// CRCOUTU<OUT16>
extern volatile __bit                   OUT16               __at(0x1AA0);	// @ (0x354 * 8 + 0)
#define                                 OUT16_bit           _BIT_ACCESS(CRCOUTU,0)
// CRCOUTU<OUT17>
extern volatile __bit                   OUT17               __at(0x1AA1);	// @ (0x354 * 8 + 1)
#define                                 OUT17_bit           _BIT_ACCESS(CRCOUTU,1)
// CRCOUTU<OUT18>
extern volatile __bit                   OUT18               __at(0x1AA2);	// @ (0x354 * 8 + 2)
#define                                 OUT18_bit           _BIT_ACCESS(CRCOUTU,2)
// CRCOUTU<OUT19>
extern volatile __bit                   OUT19               __at(0x1AA3);	// @ (0x354 * 8 + 3)
#define                                 OUT19_bit           _BIT_ACCESS(CRCOUTU,3)
// CRCOUTL<OUT2>
extern volatile __bit                   OUT2                __at(0x1A92);	// @ (0x352 * 8 + 2)
#define                                 OUT2_bit            _BIT_ACCESS(CRCOUTL,2)
// CRCOUTU<OUT20>
extern volatile __bit                   OUT20               __at(0x1AA4);	// @ (0x354 * 8 + 4)
#define                                 OUT20_bit           _BIT_ACCESS(CRCOUTU,4)
// CRCOUTU<OUT21>
extern volatile __bit                   OUT21               __at(0x1AA5);	// @ (0x354 * 8 + 5)
#define                                 OUT21_bit           _BIT_ACCESS(CRCOUTU,5)
// CRCOUTU<OUT22>
extern volatile __bit                   OUT22               __at(0x1AA6);	// @ (0x354 * 8 + 6)
#define                                 OUT22_bit           _BIT_ACCESS(CRCOUTU,6)
// CRCOUTU<OUT23>
extern volatile __bit                   OUT23               __at(0x1AA7);	// @ (0x354 * 8 + 7)
#define                                 OUT23_bit           _BIT_ACCESS(CRCOUTU,7)
// CRCOUTT<OUT24>
extern volatile __bit                   OUT24               __at(0x1AA8);	// @ (0x355 * 8 + 0)
#define                                 OUT24_bit           _BIT_ACCESS(CRCOUTT,0)
// CRCOUTT<OUT25>
extern volatile __bit                   OUT25               __at(0x1AA9);	// @ (0x355 * 8 + 1)
#define                                 OUT25_bit           _BIT_ACCESS(CRCOUTT,1)
// CRCOUTT<OUT26>
extern volatile __bit                   OUT26               __at(0x1AAA);	// @ (0x355 * 8 + 2)
#define                                 OUT26_bit           _BIT_ACCESS(CRCOUTT,2)
// CRCOUTT<OUT27>
extern volatile __bit                   OUT27               __at(0x1AAB);	// @ (0x355 * 8 + 3)
#define                                 OUT27_bit           _BIT_ACCESS(CRCOUTT,3)
// CRCOUTT<OUT28>
extern volatile __bit                   OUT28               __at(0x1AAC);	// @ (0x355 * 8 + 4)
#define                                 OUT28_bit           _BIT_ACCESS(CRCOUTT,4)
// CRCOUTT<OUT29>
extern volatile __bit                   OUT29               __at(0x1AAD);	// @ (0x355 * 8 + 5)
#define                                 OUT29_bit           _BIT_ACCESS(CRCOUTT,5)
// CRCOUTL<OUT3>
extern volatile __bit                   OUT3                __at(0x1A93);	// @ (0x352 * 8 + 3)
#define                                 OUT3_bit            _BIT_ACCESS(CRCOUTL,3)
// CRCOUTT<OUT30>
extern volatile __bit                   OUT30               __at(0x1AAE);	// @ (0x355 * 8 + 6)
#define                                 OUT30_bit           _BIT_ACCESS(CRCOUTT,6)
// CRCOUTT<OUT31>
extern volatile __bit                   OUT31               __at(0x1AAF);	// @ (0x355 * 8 + 7)
#define                                 OUT31_bit           _BIT_ACCESS(CRCOUTT,7)
// CRCOUTL<OUT4>
extern volatile __bit                   OUT4                __at(0x1A94);	// @ (0x352 * 8 + 4)
#define                                 OUT4_bit            _BIT_ACCESS(CRCOUTL,4)
// CRCOUTL<OUT5>
extern volatile __bit                   OUT5                __at(0x1A95);	// @ (0x352 * 8 + 5)
#define                                 OUT5_bit            _BIT_ACCESS(CRCOUTL,5)
// CRCOUTL<OUT6>
extern volatile __bit                   OUT6                __at(0x1A96);	// @ (0x352 * 8 + 6)
#define                                 OUT6_bit            _BIT_ACCESS(CRCOUTL,6)
// CRCOUTL<OUT7>
extern volatile __bit                   OUT7                __at(0x1A97);	// @ (0x352 * 8 + 7)
#define                                 OUT7_bit            _BIT_ACCESS(CRCOUTL,7)
// CRCOUTH<OUT8>
extern volatile __bit                   OUT8                __at(0x1A98);	// @ (0x353 * 8 + 0)
#define                                 OUT8_bit            _BIT_ACCESS(CRCOUTH,0)
// CRCOUTH<OUT9>
extern volatile __bit                   OUT9                __at(0x1A99);	// @ (0x353 * 8 + 1)
#define                                 OUT9_bit            _BIT_ACCESS(CRCOUTH,1)
// CWG1STR<OVRA>
extern volatile __bit                   OVRA                __at(0x1E24);	// @ (0x3C4 * 8 + 4)
#define                                 OVRA_bit            _BIT_ACCESS(CWG1STR,4)
// CWG1STR<OVRB>
extern volatile __bit                   OVRB                __at(0x1E25);	// @ (0x3C4 * 8 + 5)
#define                                 OVRB_bit            _BIT_ACCESS(CWG1STR,5)
// CWG1STR<OVRC>
extern volatile __bit                   OVRC                __at(0x1E26);	// @ (0x3C4 * 8 + 6)
#define                                 OVRC_bit            _BIT_ACCESS(CWG1STR,6)
// CWG1STR<OVRD>
extern volatile __bit                   OVRD                __at(0x1E27);	// @ (0x3C4 * 8 + 7)
#define                                 OVRD_bit            _BIT_ACCESS(CWG1STR,7)
// U1P1H<P1H>
extern volatile __bit                   P1H                 __at(0x1530);	// @ (0x2A6 * 8 + 0)
#define                                 P1H_bit             _BIT_ACCESS(U1P1H,0)
// U1P2H<P2H>
extern volatile __bit                   P2H                 __at(0x1540);	// @ (0x2A8 * 8 + 0)
#define                                 P2H_bit             _BIT_ACCESS(U1P2H,0)
// U1P3H<P3H>
extern volatile __bit                   P3H                 __at(0x1550);	// @ (0x2AA * 8 + 0)
#define                                 P3H_bit             _BIT_ACCESS(U1P3H,0)
// I2C1PIE<PC1IE>
extern volatile __bit                   PC1IE               __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 PC1IE_bit           _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PC1IF>
extern volatile __bit                   PC1IF               __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 PC1IF_bit           _BIT_ACCESS(I2C1PIR,2)
// I2C1PIE<PCIE>
extern volatile __bit                   PCIE                __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 PCIE_bit            _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PCIF>
extern volatile __bit                   PCIF                __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 PCIF_bit            _BIT_ACCESS(I2C1PIR,2)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x2230);	// @ (0x446 * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x1AB8);	// @ (0x357 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x1AB9);	// @ (0x357 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x1ABA);	// @ (0x357 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x1ABB);	// @ (0x357 * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// CRCCON1<PLEN4>
extern volatile __bit                   PLEN4               __at(0x1ABC);	// @ (0x357 * 8 + 4)
#define                                 PLEN4_bit           _BIT_ACCESS(CRCCON1,4)
// OSCEN<PLLEN>
extern volatile __bit                   PLLEN               __at(0x598);	// @ (0xB3 * 8 + 0)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCEN,0)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x590);	// @ (0xB2 * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// VREGCON<PMSYS0>
extern volatile __bit                   PMSYS0              __at(0x244);	// @ (0x48 * 8 + 4)
#define                                 PMSYS0_bit          _BIT_ACCESS(VREGCON,4)
// VREGCON<PMSYS1>
extern volatile __bit                   PMSYS1              __at(0x245);	// @ (0x48 * 8 + 5)
#define                                 PMSYS1_bit          _BIT_ACCESS(VREGCON,5)
// CWG1CON1<POLA>
extern volatile __bit                   POLA                __at(0x1E08);	// @ (0x3C1 * 8 + 0)
#define                                 POLA_bit            _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<POLB>
extern volatile __bit                   POLB                __at(0x1E09);	// @ (0x3C1 * 8 + 1)
#define                                 POLB_bit            _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<POLC>
extern volatile __bit                   POLC                __at(0x1E0A);	// @ (0x3C1 * 8 + 2)
#define                                 POLC_bit            _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<POLD>
extern volatile __bit                   POLD                __at(0x1E0B);	// @ (0x3C1 * 8 + 3)
#define                                 POLD_bit            _BIT_ACCESS(CWG1CON1,3)
// PCON0<POR>
extern volatile __bit                   POR                 __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(PCON0,1)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0x1FA7);	// @ (0x3F4 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x1000);	// @ (0x200 * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0x1F88);	// @ (0x3F1 * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0x1F89);	// @ (0x3F1 * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0x1F92);	// @ (0x3F2 * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0x1F93);	// @ (0x3F2 * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0x1F94);	// @ (0x3F2 * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0x1F8A);	// @ (0x3F1 * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0x1F8B);	// @ (0x3F1 * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0x1F8C);	// @ (0x3F1 * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0x1F8D);	// @ (0x3F1 * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0x1F8E);	// @ (0x3F1 * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0x1F8F);	// @ (0x3F1 * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0x1F90);	// @ (0x3F2 * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0x1F91);	// @ (0x3F2 * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0x1FC0);	// @ (0x3F8 * 8 + 0)
#define                                 PREF0_bit           _BIT_ACCESS(ADREF,0)
// ADREF<PREF1>
extern volatile __bit                   PREF1               __at(0x1FC1);	// @ (0x3F8 * 8 + 1)
#define                                 PREF1_bit           _BIT_ACCESS(ADREF,1)
// ADREF<PREF2>
extern volatile __bit                   PREF2               __at(0x1FC2);	// @ (0x3F8 * 8 + 2)
#define                                 PREF2_bit           _BIT_ACCESS(ADREF,2)
// ADREF<PREF3>
extern volatile __bit                   PREF3               __at(0x1FC3);	// @ (0x3F8 * 8 + 3)
#define                                 PREF3_bit           _BIT_ACCESS(ADREF,3)
// ADPREVL<PREV0>
extern volatile __bit                   PREV0               __at(0x1F40);	// @ (0x3E8 * 8 + 0)
#define                                 PREV0_bit           _BIT_ACCESS(ADPREVL,0)
// ADPREVL<PREV1>
extern volatile __bit                   PREV1               __at(0x1F41);	// @ (0x3E8 * 8 + 1)
#define                                 PREV1_bit           _BIT_ACCESS(ADPREVL,1)
// ADPREVH<PREV10>
extern volatile __bit                   PREV10              __at(0x1F4A);	// @ (0x3E9 * 8 + 2)
#define                                 PREV10_bit          _BIT_ACCESS(ADPREVH,2)
// ADPREVH<PREV11>
extern volatile __bit                   PREV11              __at(0x1F4B);	// @ (0x3E9 * 8 + 3)
#define                                 PREV11_bit          _BIT_ACCESS(ADPREVH,3)
// ADPREVH<PREV12>
extern volatile __bit                   PREV12              __at(0x1F4C);	// @ (0x3E9 * 8 + 4)
#define                                 PREV12_bit          _BIT_ACCESS(ADPREVH,4)
// ADPREVH<PREV13>
extern volatile __bit                   PREV13              __at(0x1F4D);	// @ (0x3E9 * 8 + 5)
#define                                 PREV13_bit          _BIT_ACCESS(ADPREVH,5)
// ADPREVH<PREV14>
extern volatile __bit                   PREV14              __at(0x1F4E);	// @ (0x3E9 * 8 + 6)
#define                                 PREV14_bit          _BIT_ACCESS(ADPREVH,6)
// ADPREVH<PREV15>
extern volatile __bit                   PREV15              __at(0x1F4F);	// @ (0x3E9 * 8 + 7)
#define                                 PREV15_bit          _BIT_ACCESS(ADPREVH,7)
// ADPREVL<PREV2>
extern volatile __bit                   PREV2               __at(0x1F42);	// @ (0x3E8 * 8 + 2)
#define                                 PREV2_bit           _BIT_ACCESS(ADPREVL,2)
// ADPREVL<PREV3>
extern volatile __bit                   PREV3               __at(0x1F43);	// @ (0x3E8 * 8 + 3)
#define                                 PREV3_bit           _BIT_ACCESS(ADPREVL,3)
// ADPREVL<PREV4>
extern volatile __bit                   PREV4               __at(0x1F44);	// @ (0x3E8 * 8 + 4)
#define                                 PREV4_bit           _BIT_ACCESS(ADPREVL,4)
// ADPREVL<PREV5>
extern volatile __bit                   PREV5               __at(0x1F45);	// @ (0x3E8 * 8 + 5)
#define                                 PREV5_bit           _BIT_ACCESS(ADPREVL,5)
// ADPREVL<PREV6>
extern volatile __bit                   PREV6               __at(0x1F46);	// @ (0x3E8 * 8 + 6)
#define                                 PREV6_bit           _BIT_ACCESS(ADPREVL,6)
// ADPREVL<PREV7>
extern volatile __bit                   PREV7               __at(0x1F47);	// @ (0x3E8 * 8 + 7)
#define                                 PREV7_bit           _BIT_ACCESS(ADPREVL,7)
// ADPREVH<PREV8>
extern volatile __bit                   PREV8               __at(0x1F48);	// @ (0x3E9 * 8 + 0)
#define                                 PREV8_bit           _BIT_ACCESS(ADPREVH,0)
// ADPREVH<PREV9>
extern volatile __bit                   PREV9               __at(0x1F49);	// @ (0x3E9 * 8 + 1)
#define                                 PREV9_bit           _BIT_ACCESS(ADPREVH,1)
// PRLOCK<PRLOCKED>
extern volatile __bit                   PRLOCKED            __at(0x5A0);	// @ (0xB4 * 8 + 0)
#define                                 PRLOCKED_bit        _BIT_ACCESS(PRLOCK,0)
// WDTCON0<PS0>
extern volatile __bit                   PS0                 __at(0x3C1);	// @ (0x78 * 8 + 1)
#define                                 PS0_bit             _BIT_ACCESS(WDTCON0,1)
// WDTCON0<PS1>
extern volatile __bit                   PS1                 __at(0x3C2);	// @ (0x78 * 8 + 2)
#define                                 PS1_bit             _BIT_ACCESS(WDTCON0,2)
// WDTCON0<PS2>
